RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/EWARM/HDSC_HC32F480.svd
                <register>
                    <name>MMC_TRSSTSR</name>
                    <description>desc MMC_TRSSTSR</description>
                    <addressOffset>0x10108</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x16F000C</resetMask>
                    <fields>
                        <field>
                            <name>TXBGIS</name>
                            <description>desc TXBGIS</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TXMGIS</name>
                            <description>desc TXMGIS</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TXDEEIS</name>
                            <description>desc TXDEEIS</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TXLCEIS</name>
                            <description>desc TXLCEIS</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TXECEIS</name>
                            <description>desc TXECEIS</description>
                            <msb>18</msb>
                            <lsb>18</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TXCAEIS</name>
                            <description>desc TXCAEIS</description>
                            <msb>19</msb>
                            <lsb>19</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TXUGIS</name>
                            <description>desc TXUGIS</description>
                            <msb>21</msb>
                            <lsb>21</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TXEDEIS</name>
                            <description>desc TXEDEIS</description>
                            <msb>22</msb>
                            <lsb>22</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RESV4</name>
                            <description>desc RESV4</description>
                            <msb>24</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MMC_RITCTLR</name>
                    <description>desc MMC_RITCTLR</description>
                    <addressOffset>0x1010C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x10E00F8</resetMask>
                    <fields>
                        <field>
                            <name>RXBGIM</name>
                            <description>desc RXBGIM</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RXMGIM</name>
                            <description>desc RXMGIM</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RXCEIM</name>
                            <description>desc RXCEIM</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RXAEIM</name>
                            <description>desc RXAEIM</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RXREIM</name>
                            <description>desc RXREIM</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RXUGIM</name>
                            <description>desc RXUGIM</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RXLEIM</name>
                            <description>desc RXLEIM</description>
                            <msb>18</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RXOEIM</name>
                            <description>desc RXOEIM</description>
                            <msb>19</msb>
                            <lsb>19</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RESV5</name>
                            <description>desc RESV5</description>
                            <msb>24</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MMC_TITCTLR</name>
                    <description>desc MMC_TITCTLR</description>
                    <addressOffset>0x10110</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x16F000C</resetMask>
                    <fields>
                        <field>
                            <name>TXBGIM</name>
                            <description>desc TXBGIM</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TXMGIM</name>
                            <description>desc TXMGIM</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TXDEEIM</name>
                            <description>desc TXDEEIM</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TXLCEIM</name>
                            <description>desc TXLCEIM</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TXECEIM</name>
                            <description>desc TXECEIM</description>
                            <msb>18</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TXCAEIM</name>
                            <description>desc TXCAEIM</description>
                            <msb>19</msb>
                            <lsb>19</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TXUGIM</name>
                            <description>desc TXUGIM</description>
                            <msb>21</msb>
                            <lsb>21</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TXEDEIM</name>
                            <description>desc TXEDEIM</description>
                            <msb>22</msb>
                            <lsb>22</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RESV6</name>
                            <description>desc RESV6</description>
                            <msb>24</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MMC_TXBRGFR</name>
                    <description>desc MMC_TXBRGFR</description>
                    <addressOffset>0x1011C</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>MMC_TXMUGFR</name>
                    <description>desc MMC_TXMUGFR</description>
                    <addressOffset>0x10120</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>MMC_TXDEEFR</name>
                    <description>desc MMC_TXDEEFR</description>
                    <addressOffset>0x10154</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>MMC_TXLCEFR</name>
                    <description>desc MMC_TXLCEFR</description>
                    <addressOffset>0x10158</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>MMC_TXECEFR</name>
                    <description>desc MMC_TXECEFR</description>
                    <addressOffset>0x1015C</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>MMC_TXCAEFR</name>
                    <description>desc MMC_TXCAEFR</description>
                    <addressOffset>0x10160</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>MMC_TXUNGFR</name>
                    <description>desc MMC_TXUNGFR</description>
                    <addressOffset>0x10168</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>MMC_TXEDEFR</name>
                    <description>desc MMC_TXEDEFR</description>
                    <addressOffset>0x1016C</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>MMC_RXBRGFR</name>
                    <description>desc MMC_RXBRGFR</description>
                    <addressOffset>0x1018C</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>MMC_RXMUGFR</name>
                    <description>desc MMC_RXMUGFR</description>
                    <addressOffset>0x10190</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>MMC_RXCREFR</name>
                    <description>desc MMC_RXCREFR</description>
                    <addressOffset>0x10194</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>MMC_RXALEFR</name>
                    <description>desc MMC_RXALEFR</description>
                    <addressOffset>0x10198</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>MMC_RXRUEFR</name>
                    <description>desc MMC_RXRUEFR</description>
                    <addressOffset>0x1019C</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>MMC_RXUNGFR</name>
                    <description>desc MMC_RXUNGFR</description>
                    <addressOffset>0x101C4</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>MMC_RXLEEFR</name>
                    <description>desc MMC_RXLEEFR</description>
                    <addressOffset>0x101C8</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>MMC_RXOREFR</name>
                    <description>desc MMC_RXOREFR</description>
                    <addressOffset>0x101CC</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>MAC_L34CTLR</name>
                    <description>desc MAC_L34CTLR</description>
                    <addressOffset>0x10400</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x13DFFFD</resetMask>
                    <fields>
                        <field>
                            <name>L3PEN</name>
                            <description>desc L3PEN</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>L3SAM</name>
                            <description>desc L3SAM</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>L3SAIM</name>
                            <description>desc L3SAIM</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>L3DAM</name>
                            <description>desc L3DAM</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>L3DAIM</name>
                            <description>desc L3DAIM</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>L3HSBM</name>
                            <description>desc L3HSBM</description>
                            <msb>10</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>L3HDBM</name>
                            <description>desc L3HDBM</description>
                            <msb>15</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>L4PEN</name>
                            <description>desc L4PEN</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>L4SPM</name>
                            <description>desc L4SPM</description>
                            <msb>18</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>L4SPIM</name>
                            <description>desc L4SPIM</description>
                            <msb>19</msb>
                            <lsb>19</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>L4DPM</name>
                            <description>desc L4DPM</description>
                            <msb>20</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>L4DPIM</name>
                            <description>desc L4DPIM</description>
                            <msb>21</msb>
                            <lsb>21</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RESV1</name>
                            <description>desc RESV1</description>
                            <msb>24</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MAC_L4PORTR</name>
                    <description>desc MAC_L4PORTR</description>
                    <addressOffset>0x10404</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>L4SPVAL</name>
                            <description>desc L4SPVAL</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>L4DPVAL</name>
                            <description>desc L4DPVAL</description>
                            <msb>31</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MAC_L3ADDRR0</name>
                    <description>desc MAC_L3ADDRR0</description>
                    <addressOffset>0x10410</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>MAC_L3ADDRR1</name>
                    <description>desc MAC_L3ADDRR1</description>
                    <addressOffset>0x10414</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>MAC_L3ADDRR2</name>
                    <description>desc MAC_L3ADDRR2</description>
                    <addressOffset>0x10418</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>MAC_L3ADDRR3</name>
                    <description>desc MAC_L3ADDRR3</description>
                    <addressOffset>0x1041C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
