RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/EWARM/HDSC_HC32F480.svd
                <register>
                    <name>MAC_VTACTLR</name>
                    <description>desc MAC_VTACTLR</description>
                    <addressOffset>0x10584</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x40000</resetValue>
                    <resetMask>0x103FFFF</resetMask>
                    <fields>
                        <field>
                            <name>VLANV</name>
                            <description>desc VLANV</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VLANC</name>
                            <description>desc VLANC</description>
                            <msb>17</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RESV7</name>
                            <description>desc RESV7</description>
                            <msb>24</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MAC_VLAHTBR</name>
                    <description>desc MAC_VLAHTBR</description>
                    <addressOffset>0x10588</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>PTP_TSPCTLR</name>
                    <description>desc PTP_TSPCTLR</description>
                    <addressOffset>0x10700</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x4000</resetValue>
                    <resetMask>0x107FF3F</resetMask>
                    <fields>
                        <field>
                            <name>TSPEN</name>
                            <description>desc TSPEN</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSPUPSEL</name>
                            <description>desc TSPUPSEL</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSPINI</name>
                            <description>desc TSPINI</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSPUP</name>
                            <description>desc TSPUP</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSPINT</name>
                            <description>desc TSPINT</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSPADUP</name>
                            <description>desc TSPADUP</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSPEALL</name>
                            <description>desc TSPEALL</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSPSSR</name>
                            <description>desc TSPSSR</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSPVER</name>
                            <description>desc TSPVER</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSPOVETH</name>
                            <description>desc TSPOVETH</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSPOVIPV6</name>
                            <description>desc TSPOVIPV6</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSPOVIPV4</name>
                            <description>desc TSPOVIPV4</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSPMTSEL</name>
                            <description>desc TSPMTSEL</description>
                            <msb>17</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSPADF</name>
                            <description>desc TSPADF</description>
                            <msb>18</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RESV2</name>
                            <description>desc RESV2</description>
                            <msb>24</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PTP_TSPNSAR</name>
                    <description>desc PTP_TSPNSAR</description>
                    <addressOffset>0x10704</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>PTP_TMSSECR</name>
                    <description>desc PTP_TMSSECR</description>
                    <addressOffset>0x10708</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>PTP_TMSNSER</name>
                    <description>desc PTP_TMSNSER</description>
                    <addressOffset>0x1070C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>PTP_TMUSECR</name>
                    <description>desc PTP_TMUSECR</description>
                    <addressOffset>0x10710</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>PTP_TMUNSER</name>
                    <description>desc PTP_TMUNSER</description>
                    <addressOffset>0x10714</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>PTP_TSPADDR</name>
                    <description>desc PTP_TSPADDR</description>
                    <addressOffset>0x10718</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>PTP_TMTSECR0</name>
                    <description>desc PTP_TMTSECR0</description>
                    <addressOffset>0x1071C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>PTP_TMTNSER0</name>
                    <description>desc PTP_TMTNSER0</description>
                    <addressOffset>0x10720</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>PTP_TSPSTSR</name>
                    <description>desc PTP_TSPSTSR</description>
                    <addressOffset>0x10728</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3B</resetMask>
                    <fields>
                        <field>
                            <name>TSOVF</name>
                            <description>desc TSOVF</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TSTAR0</name>
                            <description>desc TSTAR0</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TSERR0</name>
                            <description>desc TSERR0</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TSTAR1</name>
                            <description>desc TSTAR1</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TSERR1</name>
                            <description>desc TSERR1</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PTP_PPSCTLR</name>
                    <description>desc PTP_PPSCTLR</description>
                    <addressOffset>0x1072C</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x677F</resetMask>
                    <fields>
                        <field>
                            <name>PPSFRE0</name>
                            <description>desc PPSFRE0</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PPSOMD</name>
                            <description>desc PPSOMD</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TT0SEL</name>
                            <description>desc TT0SEL</description>
                            <msb>6</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PPSFRE1</name>
                            <description>desc PPSFRE1</description>
                            <msb>10</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TT1SEL</name>
                            <description>desc TT1SEL</description>
                            <msb>14</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PTP_TMTSECR1</name>
                    <description>desc PTP_TMTSECR1</description>
                    <addressOffset>0x10780</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>PTP_TMTNSER1</name>
                    <description>desc PTP_TMTNSER1</description>
                    <addressOffset>0x10784</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>DMA_BUSMODR</name>
                    <description>desc DMA_BUSMODR</description>
                    <addressOffset>0x11000</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x20101</resetValue>
                    <resetMask>0xFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SWR</name>
                            <description>desc SWR</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DMAA</name>
                            <description>desc DMAA</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DSL</name>
                            <description>desc DSL</description>
                            <msb>6</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DSEN</name>
                            <description>desc DSEN</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TPBL</name>
                            <description>desc TPBL</description>
                            <msb>13</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PRAT</name>
                            <description>desc PRAT</description>
                            <msb>15</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FBST</name>
                            <description>desc FBST</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RPBL</name>
                            <description>desc RPBL</description>
                            <msb>22</msb>
                            <lsb>17</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SPBL</name>
                            <description>desc SPBL</description>
                            <msb>23</msb>
                            <lsb>23</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>M8PBL</name>
                            <description>desc M8PBL</description>
                            <msb>24</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AAL</name>
                            <description>desc AAL</description>
                            <msb>25</msb>
                            <lsb>25</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MBST</name>
                            <description>desc MBST</description>
                            <msb>26</msb>
                            <lsb>26</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TXPR</name>
                            <description>desc TXPR</description>
                            <msb>27</msb>
                            <lsb>27</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMA_TXPOLLR</name>
                    <description>desc DMA_TXPOLLR</description>
                    <addressOffset>0x11004</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>DMA_RXPOLLR</name>
                    <description>desc DMA_RXPOLLR</description>
                    <addressOffset>0x11008</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>DMA_RXDLADR</name>
                    <description>desc DMA_RXDLADR</description>
                    <addressOffset>0x1100C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>DMA_TXDLADR</name>
                    <description>desc DMA_TXDLADR</description>
                    <addressOffset>0x11010</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
