RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/EWARM/HDSC_HC32F480.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>EXMC</name>
            <description>desc EXMC</description>
            <baseAddress>0x40050000</baseAddress>
            <alternatePeripheral>ETH</alternatePeripheral>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x480B8180</size>
            </addressBlock>
            <registers>
                <register>
                    <name>EXMC_EXCR0</name>
                    <description>desc EXMC_EXCR0</description>
                    <addressOffset>0x5420</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7</resetMask>
                    <fields>
                        <field>
                            <name>DMCEN</name>
                            <description>desc DMCEN</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SMCEN</name>
                            <description>desc SMCEN</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NFCEN</name>
                            <description>desc NFCEN</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EXMC_EXCR1</name>
                    <description>desc EXMC_EXCR1</description>
                    <addressOffset>0x5424</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1010206</resetMask>
                    <fields>
                        <field>
                            <name>DMCMW</name>
                            <description>desc DMCMW</description>
                            <msb>2</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SMCMUX</name>
                            <description>desc SMCMUX</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NFCOPENP</name>
                            <description>desc NFCOPENP</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RESV12</name>
                            <description>desc RESV12</description>
                            <msb>24</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMC_STSR</name>
                    <description>desc DMC_STSR</description>
                    <addressOffset>0x47FB0000</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x380</resetValue>
                    <resetMask>0xF</resetMask>
                    <fields>
                        <field>
                            <name>STATUS</name>
                            <description>desc STATUS</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MEMMW</name>
                            <description>desc MEMMW</description>
                            <msb>3</msb>
                            <lsb>2</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMC_STCR</name>
                    <description>desc DMC_STCR</description>
                    <addressOffset>0x47FB0004</addressOffset>
                    <size>8</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7</resetMask>
                    <fields>
                        <field>
                            <name>STCTL</name>
                            <description>desc STCTL</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMC_CMDR</name>
                    <description>desc DMC_CMDR</description>
                    <addressOffset>0x47FB0008</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x13F3FFF</resetMask>
                    <fields>
                        <field>
                            <name>CMDADD</name>
                            <description>desc CMDADD</description>
                            <msb>13</msb>
                            <lsb>0</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CMDBA</name>
                            <description>desc CMDBA</description>
                            <msb>17</msb>
                            <lsb>16</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CMD</name>
                            <description>desc CMD</description>
                            <msb>19</msb>
                            <lsb>18</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CMDCHIP</name>
                            <description>desc CMDCHIP</description>
                            <msb>21</msb>
                            <lsb>20</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>RESV5</name>
                            <description>desc RESV5</description>
                            <msb>24</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMC_BACR</name>
                    <description>desc DMC_BACR</description>
                    <addressOffset>0x47FB000C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x10020</resetValue>
                    <resetMask>0x163FFFF</resetMask>
                    <fields>
                        <field>
                            <name>COLBS</name>
                            <description>desc COLBS</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ROWBS</name>
                            <description>desc ROWBS</description>
                            <msb>5</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>APBS</name>
                            <description>desc APBS</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CKEDISPRD</name>
                            <description>desc CKEDISPRD</description>
                            <msb>12</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CKEDIS</name>
                            <description>desc CKEDIS</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CKSTOP</name>
                            <description>desc CKSTOP</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BURST</name>
                            <description>desc BURST</description>
                            <msb>17</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ACTCP</name>
                            <description>desc ACTCP</description>
                            <msb>22</msb>
                            <lsb>21</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RESV6</name>
                            <description>desc RESV6</description>
                            <msb>24</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMC_RFCR</name>
                    <description>desc DMC_RFCR</description>
                    <addressOffset>0x47FB0010</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0xA60</resetValue>
                    <resetMask>0x7FFF</resetMask>
                    <fields>
                        <field>
                            <name>REFPRD</name>
                            <description>desc REFPRD</description>
                            <msb>14</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMC_TMCR_T_CASL</name>
                    <description>desc DMC_TMCR_T_CASL</description>
                    <addressOffset>0x47FB0014</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x6</resetValue>
                    <resetMask>0xE</resetMask>
                    <fields>
                        <field>
                            <name>T_CASL</name>
                            <description>desc T_CASL</description>
                            <msb>3</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMC_TMCR_T_DQSS</name>
                    <description>desc DMC_TMCR_T_DQSS</description>
                    <addressOffset>0x47FB0018</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x1</resetValue>
                    <resetMask>0x3</resetMask>
                    <fields>
                        <field>
                            <name>T_DQSS</name>
                            <description>desc T_DQSS</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMC_TMCR_T_MRD</name>
                    <description>desc DMC_TMCR_T_MRD</description>
                    <addressOffset>0x47FB001C</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x2</resetValue>
                    <resetMask>0x7F</resetMask>
                    <fields>
                        <field>
                            <name>T_MRD</name>
                            <description>desc T_MRD</description>
                            <msb>6</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMC_TMCR_T_RAS</name>
                    <description>desc DMC_TMCR_T_RAS</description>
                    <addressOffset>0x47FB0020</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x7</resetValue>
                    <resetMask>0xF</resetMask>
                    <fields>
                        <field>
                            <name>T_RAS</name>
                            <description>desc T_RAS</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMC_TMCR_T_RC</name>
                    <description>desc DMC_TMCR_T_RC</description>
                    <addressOffset>0x47FB0024</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0xB</resetValue>
                    <resetMask>0xF</resetMask>
                    <fields>
                        <field>
                            <name>T_RC</name>
                            <description>desc T_RC</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMC_TMCR_T_RCD</name>
                    <description>desc DMC_TMCR_T_RCD</description>
                    <addressOffset>0x47FB0028</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x1D</resetValue>
                    <resetMask>0x7</resetMask>
                    <fields>
                        <field>
                            <name>T_RCD</name>
                            <description>desc T_RCD</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMC_TMCR_T_RFC</name>
                    <description>desc DMC_TMCR_T_RFC</description>
                    <addressOffset>0x47FB002C</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x212</resetValue>
                    <resetMask>0x1F</resetMask>
                    <fields>
                        <field>
                            <name>T_RFC</name>
                            <description>desc T_RFC</description>
                            <msb>4</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMC_TMCR_T_RP</name>
                    <description>desc DMC_TMCR_T_RP</description>
                    <addressOffset>0x47FB0030</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x1D</resetValue>
                    <resetMask>0x7</resetMask>
                    <fields>
                        <field>
                            <name>T_RP</name>
                            <description>desc T_RP</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMC_TMCR_T_RRD</name>
                    <description>desc DMC_TMCR_T_RRD</description>
                    <addressOffset>0x47FB0034</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x2</resetValue>
                    <resetMask>0xF</resetMask>
                    <fields>
                        <field>
                            <name>T_RRD</name>
                            <description>desc T_RRD</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMC_TMCR_T_WR</name>
                    <description>desc DMC_TMCR_T_WR</description>
                    <addressOffset>0x47FB0038</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x3</resetValue>
                    <resetMask>0x7</resetMask>
                    <fields>
                        <field>
                            <name>T_WR</name>
                            <description>desc T_WR</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMC_TMCR_T_WTR</name>
                    <description>desc DMC_TMCR_T_WTR</description>
                    <addressOffset>0x47FB003C</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x2</resetValue>
                    <resetMask>0x7</resetMask>
                    <fields>
                        <field>
                            <name>T_WTR</name>
                            <description>desc T_WTR</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMC_TMCR_T_XP</name>
                    <description>desc DMC_TMCR_T_XP</description>
                    <addressOffset>0x47FB0040</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x1</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>DMC_TMCR_T_XSR</name>
                    <description>desc DMC_TMCR_T_XSR</description>
                    <addressOffset>0x47FB0044</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0xA</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>DMC_TMCR_T_ESR</name>
                    <description>desc DMC_TMCR_T_ESR</description>
                    <addressOffset>0x47FB0048</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x14</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>DMC_CPCR0</name>
                    <description>desc DMC_CPCR0</description>
                    <addressOffset>0x47FB0200</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFF00</resetValue>
                    <resetMask>0x101FFFF</resetMask>
                    <fields>
                        <field>
                            <name>ADDMSK0</name>
                            <description>desc ADDMSK0</description>
                            <msb>7</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ADDMAT0</name>
                            <description>desc ADDMAT0</description>
                            <msb>15</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BRC0</name>
                            <description>desc BRC0</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RESV8</name>
                            <description>desc RESV8</description>
                            <msb>24</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
