RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/EWARM/HDSC_HC32F480.svd
                <register>
                    <name>DMC_CPCR1</name>
                    <description>desc DMC_CPCR1</description>
                    <addressOffset>0x47FB0204</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFF00</resetValue>
                    <resetMask>0x101FFFF</resetMask>
                    <fields>
                        <field>
                            <name>ADDMSK1</name>
                            <description>desc ADDMSK1</description>
                            <msb>7</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ADDMAT1</name>
                            <description>desc ADDMAT1</description>
                            <msb>15</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BRC1</name>
                            <description>desc BRC1</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RESV9</name>
                            <description>desc RESV9</description>
                            <msb>24</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMC_CPCR2</name>
                    <description>desc DMC_CPCR2</description>
                    <addressOffset>0x47FB0208</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFF00</resetValue>
                    <resetMask>0x101FFFF</resetMask>
                    <fields>
                        <field>
                            <name>ADDMSK2</name>
                            <description>desc ADDMSK2</description>
                            <msb>7</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ADDMAT2</name>
                            <description>desc ADDMAT2</description>
                            <msb>15</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BRC2</name>
                            <description>desc BRC2</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RESV10</name>
                            <description>desc RESV10</description>
                            <msb>24</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMC_CPCR3</name>
                    <description>desc DMC_CPCR3</description>
                    <addressOffset>0x47FB020C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFF00</resetValue>
                    <resetMask>0x101FFFF</resetMask>
                    <fields>
                        <field>
                            <name>ADDMSK3</name>
                            <description>desc ADDMSK3</description>
                            <msb>7</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ADDMAT3</name>
                            <description>desc ADDMAT3</description>
                            <msb>15</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BRC3</name>
                            <description>desc BRC3</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RESV11</name>
                            <description>desc RESV11</description>
                            <msb>24</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EXMC_EXSR1</name>
                    <description>desc EXMC_EXSR1</description>
                    <addressOffset>0x47FB0300</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>SMC_STSR</name>
                    <description>desc SMC_STSR</description>
                    <addressOffset>0x47FB1000</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x1</resetValue>
                    <resetMask>0x1</resetMask>
                    <fields>
                        <field>
                            <name>STATUS</name>
                            <description>desc STATUS</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SMC_STCR0</name>
                    <description>desc SMC_STCR0</description>
                    <addressOffset>0x47FB1008</addressOffset>
                    <size>8</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x4</resetMask>
                    <fields>
                        <field>
                            <name>LPWIR</name>
                            <description>desc LPWIR</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SMC_STCR1</name>
                    <description>desc SMC_STCR1</description>
                    <addressOffset>0x47FB100C</addressOffset>
                    <size>8</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x4</resetMask>
                    <fields>
                        <field>
                            <name>LPWOR</name>
                            <description>desc LPWOR</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SMC_CMDR</name>
                    <description>desc SMC_CMDR</description>
                    <addressOffset>0x47FB1010</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3FFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CMDADD</name>
                            <description>desc CMDADD</description>
                            <msb>19</msb>
                            <lsb>0</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CRES</name>
                            <description>desc CRES</description>
                            <msb>20</msb>
                            <lsb>20</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CMD</name>
                            <description>desc CMD</description>
                            <msb>22</msb>
                            <lsb>21</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CMDCHIP</name>
                            <description>desc CMDCHIP</description>
                            <msb>25</msb>
                            <lsb>23</lsb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SMC_TMCR</name>
                    <description>desc SMC_TMCR</description>
                    <addressOffset>0x47FB1014</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x10FFFFF</resetMask>
                    <fields>
                        <field>
                            <name>T_RC</name>
                            <description>desc T_RC</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>T_WC</name>
                            <description>desc T_WC</description>
                            <msb>7</msb>
                            <lsb>4</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>T_CEOE</name>
                            <description>desc T_CEOE</description>
                            <msb>10</msb>
                            <lsb>8</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>T_WP</name>
                            <description>desc T_WP</description>
                            <msb>13</msb>
                            <lsb>11</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>T_PC</name>
                            <description>desc T_PC</description>
                            <msb>16</msb>
                            <lsb>14</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>T_TR</name>
                            <description>desc T_TR</description>
                            <msb>19</msb>
                            <lsb>17</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>RESV0</name>
                            <description>desc RESV0</description>
                            <msb>24</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SMC_BACR</name>
                    <description>desc SMC_BACR</description>
                    <addressOffset>0x47FB1018</addressOffset>
                    <size>16</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1FFF</resetMask>
                    <fields>
                        <field>
                            <name>MW</name>
                            <description>desc MW</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>RSYN</name>
                            <description>desc RSYN</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>RBL</name>
                            <description>desc RBL</description>
                            <msb>5</msb>
                            <lsb>3</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>WSYN</name>
                            <description>desc WSYN</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>WBL</name>
                            <description>desc WBL</description>
                            <msb>9</msb>
                            <lsb>7</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>BAAS</name>
                            <description>desc BAAS</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>ADVS</name>
                            <description>desc ADVS</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>BLSS</name>
                            <description>desc BLSS</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SMC_RFCR</name>
                    <description>desc SMC_RFCR</description>
                    <addressOffset>0x47FB1020</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xF</resetMask>
                    <fields>
                        <field>
                            <name>REFPRD</name>
                            <description>desc REFPRD</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SMC_TMSR0</name>
                    <description>desc SMC_TMSR0</description>
                    <addressOffset>0x47FB1100</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x2B3CC</resetValue>
                    <resetMask>0x10FFFFF</resetMask>
                    <fields>
                        <field>
                            <name>T_RC0</name>
                            <description>desc T_RC0</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>T_WC0</name>
                            <description>desc T_WC0</description>
                            <msb>7</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>T_CEOE0</name>
                            <description>desc T_CEOE0</description>
                            <msb>10</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>T_WP0</name>
                            <description>desc T_WP0</description>
                            <msb>13</msb>
                            <lsb>11</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>T_PC0</name>
                            <description>desc T_PC0</description>
                            <msb>16</msb>
                            <lsb>14</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>T_TR0</name>
                            <description>desc T_TR0</description>
                            <msb>19</msb>
                            <lsb>17</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RESV1</name>
                            <description>desc RESV1</description>
                            <msb>24</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SMC_BASR0</name>
                    <description>desc SMC_BASR0</description>
                    <addressOffset>0x47FB1104</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x60F80802</resetValue>
                    <resetMask>0xFFFF1FFF</resetMask>
                    <fields>
                        <field>
                            <name>MW0</name>
                            <description>desc MW0</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RSYN0</name>
                            <description>desc RSYN0</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RBL0</name>
                            <description>desc RBL0</description>
                            <msb>5</msb>
                            <lsb>3</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>WSYN0</name>
                            <description>desc WSYN0</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>WBL0</name>
                            <description>desc WBL0</description>
                            <msb>9</msb>
                            <lsb>7</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>BAAS0</name>
                            <description>desc BAAS0</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ADVS0</name>
                            <description>desc ADVS0</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>BLSS0</name>
                            <description>desc BLSS0</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ADDMSK0</name>
                            <description>desc ADDMSK0</description>
                            <msb>23</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ADDMAT0</name>
                            <description>desc ADDMAT0</description>
                            <msb>31</msb>
                            <lsb>24</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
