RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/EWARM/HDSC_HC32F480.svd
                <register>
                    <name>SMC_TMSR1</name>
                    <description>desc SMC_TMSR1</description>
                    <addressOffset>0x47FB1120</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x2B3CC</resetValue>
                    <resetMask>0x10FFFFF</resetMask>
                    <fields>
                        <field>
                            <name>T_RC1</name>
                            <description>desc T_RC1</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>T_WC1</name>
                            <description>desc T_WC1</description>
                            <msb>7</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>T_CEOE1</name>
                            <description>desc T_CEOE1</description>
                            <msb>10</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>T_WP1</name>
                            <description>desc T_WP1</description>
                            <msb>13</msb>
                            <lsb>11</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>T_PC1</name>
                            <description>desc T_PC1</description>
                            <msb>16</msb>
                            <lsb>14</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>T_TR1</name>
                            <description>desc T_TR1</description>
                            <msb>19</msb>
                            <lsb>17</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RESV2</name>
                            <description>desc RESV2</description>
                            <msb>24</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SMC_BASR1</name>
                    <description>desc SMC_BASR1</description>
                    <addressOffset>0x47FB1124</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x68F80802</resetValue>
                    <resetMask>0xFFFF1FFF</resetMask>
                    <fields>
                        <field>
                            <name>MW1</name>
                            <description>desc MW1</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RSYN1</name>
                            <description>desc RSYN1</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RBL1</name>
                            <description>desc RBL1</description>
                            <msb>5</msb>
                            <lsb>3</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>WSYN1</name>
                            <description>desc WSYN1</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>WBL1</name>
                            <description>desc WBL1</description>
                            <msb>9</msb>
                            <lsb>7</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>BAAS1</name>
                            <description>desc BAAS1</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ADVS1</name>
                            <description>desc ADVS1</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>BLSS1</name>
                            <description>desc BLSS1</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ADDMSK1</name>
                            <description>desc ADDMSK1</description>
                            <msb>23</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ADDMAT1</name>
                            <description>desc ADDMAT1</description>
                            <msb>31</msb>
                            <lsb>24</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SMC_TMSR2</name>
                    <description>desc SMC_TMSR2</description>
                    <addressOffset>0x47FB1140</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x2B3CC</resetValue>
                    <resetMask>0x10FFFFF</resetMask>
                    <fields>
                        <field>
                            <name>T_RC2</name>
                            <description>desc T_RC2</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>T_WC2</name>
                            <description>desc T_WC2</description>
                            <msb>7</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>T_CEOE2</name>
                            <description>desc T_CEOE2</description>
                            <msb>10</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>T_WP2</name>
                            <description>desc T_WP2</description>
                            <msb>13</msb>
                            <lsb>11</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>T_PC2</name>
                            <description>desc T_PC2</description>
                            <msb>16</msb>
                            <lsb>14</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>T_TR2</name>
                            <description>desc T_TR2</description>
                            <msb>19</msb>
                            <lsb>17</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RESV3</name>
                            <description>desc RESV3</description>
                            <msb>24</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SMC_BASR2</name>
                    <description>desc SMC_BASR2</description>
                    <addressOffset>0x47FB1144</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x70F80802</resetValue>
                    <resetMask>0xFFFF1FFF</resetMask>
                    <fields>
                        <field>
                            <name>MW2</name>
                            <description>desc MW2</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RSYN2</name>
                            <description>desc RSYN2</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RBL2</name>
                            <description>desc RBL2</description>
                            <msb>5</msb>
                            <lsb>3</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>WSYN2</name>
                            <description>desc WSYN2</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>WBL2</name>
                            <description>desc WBL2</description>
                            <msb>9</msb>
                            <lsb>7</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>BAAS2</name>
                            <description>desc BAAS2</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ADVS2</name>
                            <description>desc ADVS2</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>BLSS2</name>
                            <description>desc BLSS2</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ADDMSK2</name>
                            <description>desc ADDMSK2</description>
                            <msb>23</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ADDMAT2</name>
                            <description>desc ADDMAT2</description>
                            <msb>31</msb>
                            <lsb>24</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SMC_TMSR3</name>
                    <description>desc SMC_TMSR3</description>
                    <addressOffset>0x47FB1160</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x2B3CC</resetValue>
                    <resetMask>0x10FFFFF</resetMask>
                    <fields>
                        <field>
                            <name>T_RC3</name>
                            <description>desc T_RC3</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>T_WC3</name>
                            <description>desc T_WC3</description>
                            <msb>7</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>T_CEOE3</name>
                            <description>desc T_CEOE3</description>
                            <msb>10</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>T_WP3</name>
                            <description>desc T_WP3</description>
                            <msb>13</msb>
                            <lsb>11</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>T_PC3</name>
                            <description>desc T_PC3</description>
                            <msb>16</msb>
                            <lsb>14</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>T_TR3</name>
                            <description>desc T_TR3</description>
                            <msb>19</msb>
                            <lsb>17</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RESV4</name>
                            <description>desc RESV4</description>
                            <msb>24</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SMC_BASR3</name>
                    <description>desc SMC_BASR3</description>
                    <addressOffset>0x47FB1164</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x78F80802</resetValue>
                    <resetMask>0xFFFF1FFF</resetMask>
                    <fields>
                        <field>
                            <name>MW3</name>
                            <description>desc MW3</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RSYN3</name>
                            <description>desc RSYN3</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RBL3</name>
                            <description>desc RBL3</description>
                            <msb>5</msb>
                            <lsb>3</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>WSYN3</name>
                            <description>desc WSYN3</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>WBL3</name>
                            <description>desc WBL3</description>
                            <msb>9</msb>
                            <lsb>7</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>BAAS3</name>
                            <description>desc BAAS3</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ADVS3</name>
                            <description>desc ADVS3</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>BLSS3</name>
                            <description>desc BLSS3</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ADDMSK3</name>
                            <description>desc ADDMSK3</description>
                            <msb>23</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ADDMAT3</name>
                            <description>desc ADDMAT3</description>
                            <msb>31</msb>
                            <lsb>24</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EXMC_EXSR0</name>
                    <description>desc EXMC_EXSR0</description>
                    <addressOffset>0x47FB1200</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1</resetMask>
                    <fields>
                        <field>
                            <name>ECCBSY</name>
                            <description>desc ECCBSY</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>NFC_DATR_BASE</name>
                    <description>desc NFC_DATR_BASE</description>
                    <addressOffset>0x480B0000</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>NFC_CMDR</name>
                    <description>desc NFC_CMDR</description>
                    <addressOffset>0x480B8000</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CMD</name>
                            <description>desc CMD</description>
                            <msb>7</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ARG</name>
                            <description>desc ARG</description>
                            <msb>31</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>NFC_IDXR0</name>
                    <description>desc NFC_IDXR0</description>
                    <addressOffset>0x480B8004</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
