RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/EWARM/HDSC_HC32F480.svd
                <register>
                    <name>NFC_ECCR4</name>
                    <description>desc NFC_ECCR4</description>
                    <addressOffset>0x480B8070</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x80003FFF</resetMask>
                    <fields>
                        <field>
                            <name>ERRLOC</name>
                            <description>desc ERRLOC</description>
                            <msb>11</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SE</name>
                            <description>desc SE</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ME</name>
                            <description>desc ME</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RESV</name>
                            <description>desc RESV</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>NFC_ECCR5</name>
                    <description>desc NFC_ECCR5</description>
                    <addressOffset>0x480B8074</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x80003FFF</resetMask>
                    <fields>
                        <field>
                            <name>ERRLOC</name>
                            <description>desc ERRLOC</description>
                            <msb>11</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SE</name>
                            <description>desc SE</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ME</name>
                            <description>desc ME</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RESV</name>
                            <description>desc RESV</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>NFC_ECCR6</name>
                    <description>desc NFC_ECCR6</description>
                    <addressOffset>0x480B8078</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x80003FFF</resetMask>
                    <fields>
                        <field>
                            <name>ERRLOC</name>
                            <description>desc ERRLOC</description>
                            <msb>11</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SE</name>
                            <description>desc SE</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ME</name>
                            <description>desc ME</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RESV</name>
                            <description>desc RESV</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ECC_STAT</name>
                    <description>desc ECC_STAT</description>
                    <addressOffset>0x480B807C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x8000FFFF</resetMask>
                    <fields>
                        <field>
                            <name>ERRSEC</name>
                            <description>desc ERRSEC</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RESV</name>
                            <description>desc RESV</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ECC_SYND0_0</name>
                    <description>desc ECC_SYND0_0</description>
                    <addressOffset>0x480B8080</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x9FFF1FFF</resetMask>
                    <fields>
                        <field>
                            <name>S1</name>
                            <description>desc S1</description>
                            <msb>12</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>S2</name>
                            <description>desc S2</description>
                            <msb>28</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RESV</name>
                            <description>desc RESV</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ECC_SYND0_1</name>
                    <description>desc ECC_SYND0_1</description>
                    <addressOffset>0x480B8084</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x9FFF1FFF</resetMask>
                    <fields>
                        <field>
                            <name>S3</name>
                            <description>desc S3</description>
                            <msb>12</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>S4</name>
                            <description>desc S4</description>
                            <msb>28</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RESV</name>
                            <description>desc RESV</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ECC_SYND0_2</name>
                    <description>desc ECC_SYND0_2</description>
                    <addressOffset>0x480B8088</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x9FFF1FFF</resetMask>
                    <fields>
                        <field>
                            <name>S5</name>
                            <description>desc S5</description>
                            <msb>12</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>S6</name>
                            <description>desc S6</description>
                            <msb>28</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RESV</name>
                            <description>desc RESV</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ECC_SYND0_3</name>
                    <description>desc ECC_SYND0_3</description>
                    <addressOffset>0x480B808C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x9FFF1FFF</resetMask>
                    <fields>
                        <field>
                            <name>S7</name>
                            <description>desc S7</description>
                            <msb>12</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>S8</name>
                            <description>desc S8</description>
                            <msb>28</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RESV</name>
                            <description>desc RESV</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ECC_SYND1_0</name>
                    <description>desc ECC_SYND1_0</description>
                    <addressOffset>0x480B8090</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x9FFF1FFF</resetMask>
                    <fields>
                        <field>
                            <name>S1</name>
                            <description>desc S1</description>
                            <msb>12</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>S2</name>
                            <description>desc S2</description>
                            <msb>28</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RESV</name>
                            <description>desc RESV</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ECC_SYND1_1</name>
                    <description>desc ECC_SYND1_1</description>
                    <addressOffset>0x480B8094</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x9FFF1FFF</resetMask>
                    <fields>
                        <field>
                            <name>S3</name>
                            <description>desc S3</description>
                            <msb>12</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>S4</name>
                            <description>desc S4</description>
                            <msb>28</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RESV</name>
                            <description>desc RESV</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ECC_SYND1_2</name>
                    <description>desc ECC_SYND1_2</description>
                    <addressOffset>0x480B8098</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x9FFF1FFF</resetMask>
                    <fields>
                        <field>
                            <name>S5</name>
                            <description>desc S5</description>
                            <msb>12</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>S6</name>
                            <description>desc S6</description>
                            <msb>28</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RESV</name>
                            <description>desc RESV</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ECC_SYND1_3</name>
                    <description>desc ECC_SYND1_3</description>
                    <addressOffset>0x480B809C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x9FFF1FFF</resetMask>
                    <fields>
                        <field>
                            <name>S7</name>
                            <description>desc S7</description>
                            <msb>12</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>S8</name>
                            <description>desc S8</description>
                            <msb>28</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RESV</name>
                            <description>desc RESV</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ECC_SYND2_0</name>
                    <description>desc ECC_SYND2_0</description>
                    <addressOffset>0x480B80A0</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x9FFF1FFF</resetMask>
                    <fields>
                        <field>
                            <name>S1</name>
                            <description>desc S1</description>
                            <msb>12</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>S2</name>
                            <description>desc S2</description>
                            <msb>28</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RESV</name>
                            <description>desc RESV</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ECC_SYND2_1</name>
                    <description>desc ECC_SYND2_1</description>
                    <addressOffset>0x480B80A4</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x9FFF1FFF</resetMask>
                    <fields>
                        <field>
                            <name>S3</name>
                            <description>desc S3</description>
                            <msb>12</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>S4</name>
                            <description>desc S4</description>
                            <msb>28</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RESV</name>
                            <description>desc RESV</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ECC_SYND2_2</name>
                    <description>desc ECC_SYND2_2</description>
                    <addressOffset>0x480B80A8</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x9FFF1FFF</resetMask>
                    <fields>
                        <field>
                            <name>S5</name>
                            <description>desc S5</description>
                            <msb>12</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>S6</name>
                            <description>desc S6</description>
                            <msb>28</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RESV</name>
                            <description>desc RESV</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ECC_SYND2_3</name>
                    <description>desc ECC_SYND2_3</description>
                    <addressOffset>0x480B80AC</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x9FFF1FFF</resetMask>
                    <fields>
                        <field>
                            <name>S7</name>
                            <description>desc S7</description>
                            <msb>12</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>S8</name>
                            <description>desc S8</description>
                            <msb>28</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RESV</name>
                            <description>desc RESV</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
