RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/EWARM/HDSC_HC32F480.svd
                <register>
                    <name>ECC_SYND3_0</name>
                    <description>desc ECC_SYND3_0</description>
                    <addressOffset>0x480B80B0</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x9FFF1FFF</resetMask>
                    <fields>
                        <field>
                            <name>S1</name>
                            <description>desc S1</description>
                            <msb>12</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>S2</name>
                            <description>desc S2</description>
                            <msb>28</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RESV</name>
                            <description>desc RESV</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ECC_SYND3_1</name>
                    <description>desc ECC_SYND3_1</description>
                    <addressOffset>0x480B80B4</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x9FFF1FFF</resetMask>
                    <fields>
                        <field>
                            <name>S3</name>
                            <description>desc S3</description>
                            <msb>12</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>S4</name>
                            <description>desc S4</description>
                            <msb>28</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RESV</name>
                            <description>desc RESV</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ECC_SYND3_2</name>
                    <description>desc ECC_SYND3_2</description>
                    <addressOffset>0x480B80B8</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x9FFF1FFF</resetMask>
                    <fields>
                        <field>
                            <name>S5</name>
                            <description>desc S5</description>
                            <msb>12</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>S6</name>
                            <description>desc S6</description>
                            <msb>28</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RESV</name>
                            <description>desc RESV</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ECC_SYND3_3</name>
                    <description>desc ECC_SYND3_3</description>
                    <addressOffset>0x480B80BC</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x9FFF1FFF</resetMask>
                    <fields>
                        <field>
                            <name>S7</name>
                            <description>desc S7</description>
                            <msb>12</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>S8</name>
                            <description>desc S8</description>
                            <msb>28</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RESV</name>
                            <description>desc RESV</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ECC_SYND4_0</name>
                    <description>desc ECC_SYND4_0</description>
                    <addressOffset>0x480B80C0</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x9FFF1FFF</resetMask>
                    <fields>
                        <field>
                            <name>S1</name>
                            <description>desc S1</description>
                            <msb>12</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>S2</name>
                            <description>desc S2</description>
                            <msb>28</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RESV</name>
                            <description>desc RESV</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ECC_SYND4_1</name>
                    <description>desc ECC_SYND4_1</description>
                    <addressOffset>0x480B80C4</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x9FFF1FFF</resetMask>
                    <fields>
                        <field>
                            <name>S3</name>
                            <description>desc S3</description>
                            <msb>12</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>S4</name>
                            <description>desc S4</description>
                            <msb>28</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RESV</name>
                            <description>desc RESV</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ECC_SYND4_2</name>
                    <description>desc ECC_SYND4_2</description>
                    <addressOffset>0x480B80C8</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x9FFF1FFF</resetMask>
                    <fields>
                        <field>
                            <name>S5</name>
                            <description>desc S5</description>
                            <msb>12</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>S6</name>
                            <description>desc S6</description>
                            <msb>28</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RESV</name>
                            <description>desc RESV</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ECC_SYND4_3</name>
                    <description>desc ECC_SYND4_3</description>
                    <addressOffset>0x480B80CC</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x9FFF1FFF</resetMask>
                    <fields>
                        <field>
                            <name>S7</name>
                            <description>desc S7</description>
                            <msb>12</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>S8</name>
                            <description>desc S8</description>
                            <msb>28</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RESV</name>
                            <description>desc RESV</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ECC_SYND5_0</name>
                    <description>desc ECC_SYND5_0</description>
                    <addressOffset>0x480B80D0</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x9FFF1FFF</resetMask>
                    <fields>
                        <field>
                            <name>S1</name>
                            <description>desc S1</description>
                            <msb>12</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>S2</name>
                            <description>desc S2</description>
                            <msb>28</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RESV</name>
                            <description>desc RESV</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ECC_SYND5_1</name>
                    <description>desc ECC_SYND5_1</description>
                    <addressOffset>0x480B80D4</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x9FFF1FFF</resetMask>
                    <fields>
                        <field>
                            <name>S3</name>
                            <description>desc S3</description>
                            <msb>12</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>S4</name>
                            <description>desc S4</description>
                            <msb>28</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RESV</name>
                            <description>desc RESV</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ECC_SYND5_2</name>
                    <description>desc ECC_SYND5_2</description>
                    <addressOffset>0x480B80D8</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x9FFF1FFF</resetMask>
                    <fields>
                        <field>
                            <name>S5</name>
                            <description>desc S5</description>
                            <msb>12</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>S6</name>
                            <description>desc S6</description>
                            <msb>28</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RESV</name>
                            <description>desc RESV</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ECC_SYND5_3</name>
                    <description>desc ECC_SYND5_3</description>
                    <addressOffset>0x480B80DC</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x9FFF1FFF</resetMask>
                    <fields>
                        <field>
                            <name>S7</name>
                            <description>desc S7</description>
                            <msb>12</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>S8</name>
                            <description>desc S8</description>
                            <msb>28</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RESV</name>
                            <description>desc RESV</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ECC_SYND6_0</name>
                    <description>desc ECC_SYND6_0</description>
                    <addressOffset>0x480B80E0</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x9FFF1FFF</resetMask>
                    <fields>
                        <field>
                            <name>S1</name>
                            <description>desc S1</description>
                            <msb>12</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>S2</name>
                            <description>desc S2</description>
                            <msb>28</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RESV</name>
                            <description>desc RESV</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ECC_SYND6_1</name>
                    <description>desc ECC_SYND6_1</description>
                    <addressOffset>0x480B80E4</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x9FFF1FFF</resetMask>
                    <fields>
                        <field>
                            <name>S3</name>
                            <description>desc S3</description>
                            <msb>12</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>S4</name>
                            <description>desc S4</description>
                            <msb>28</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RESV</name>
                            <description>desc RESV</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ECC_SYND6_2</name>
                    <description>desc ECC_SYND6_2</description>
                    <addressOffset>0x480B80E8</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x9FFF1FFF</resetMask>
                    <fields>
                        <field>
                            <name>S5</name>
                            <description>desc S5</description>
                            <msb>12</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>S6</name>
                            <description>desc S6</description>
                            <msb>28</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RESV</name>
                            <description>desc RESV</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ECC_SYND6_3</name>
                    <description>desc ECC_SYND6_3</description>
                    <addressOffset>0x480B80EC</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x9FFF1FFF</resetMask>
                    <fields>
                        <field>
                            <name>S7</name>
                            <description>desc S7</description>
                            <msb>12</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>S8</name>
                            <description>desc S8</description>
                            <msb>28</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RESV</name>
                            <description>desc RESV</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ECC_SYND7_0</name>
                    <description>desc ECC_SYND7_0</description>
                    <addressOffset>0x480B80F0</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x9FFF1FFF</resetMask>
                    <fields>
                        <field>
                            <name>S1</name>
                            <description>desc S1</description>
                            <msb>12</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>S2</name>
                            <description>desc S2</description>
                            <msb>28</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RESV</name>
                            <description>desc RESV</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
