RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/EWARM/HDSC_HC32F480.svd
                <register>
                    <name>SCLRR</name>
                    <description>desc SCLRR</description>
                    <addressOffset>0x3FC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x10003FF</resetMask>
                    <fields>
                        <field>
                            <name>SCLE0</name>
                            <description>desc SCLE0</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SCLE1</name>
                            <description>desc SCLE1</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SCLE2</name>
                            <description>desc SCLE2</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SCLE3</name>
                            <description>desc SCLE3</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SCLE4</name>
                            <description>desc SCLE4</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SCLE5</name>
                            <description>desc SCLE5</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SCLE6</name>
                            <description>desc SCLE6</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SCLE7</name>
                            <description>desc SCLE7</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SCLE8</name>
                            <description>desc SCLE8</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SCLE9</name>
                            <description>desc SCLE9</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RESV</name>
                            <description>desc RESV</description>
                            <msb>24</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral derivedFrom="TMR60">
            <name>TMR61</name>
            <description>desc TMR6</description>
            <baseAddress>0x40018400</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x3F6</size>
            </addressBlock>
        </peripheral>
        <peripheral derivedFrom="TMR60">
            <name>TMR62</name>
            <description>desc TMR6</description>
            <baseAddress>0x40018800</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x3F6</size>
            </addressBlock>
        </peripheral>
        <peripheral derivedFrom="TMR60">
            <name>TMR63</name>
            <description>desc TMR6</description>
            <baseAddress>0x40018C00</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x3F6</size>
            </addressBlock>
        </peripheral>
        <peripheral derivedFrom="TMR60">
            <name>TMR64</name>
            <description>desc TMR6</description>
            <baseAddress>0x40019000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x3F6</size>
            </addressBlock>
        </peripheral>
        <peripheral derivedFrom="TMR60">
            <name>TMR65</name>
            <description>desc TMR6</description>
            <baseAddress>0x40019400</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x3F6</size>
            </addressBlock>
        </peripheral>
        <peripheral derivedFrom="TMR60">
            <name>TMR66</name>
            <description>desc TMR6</description>
            <baseAddress>0x40019800</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x3F6</size>
            </addressBlock>
        </peripheral>
        <peripheral derivedFrom="TMR60">
            <name>TMR67</name>
            <description>desc TMR6</description>
            <baseAddress>0x40019C00</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x3F6</size>
            </addressBlock>
        </peripheral>
