RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/EWARM/HDSC_HC32F480.svd
        <peripheral derivedFrom="TMR60">
            <name>TMR68</name>
            <description>desc TMR6</description>
            <baseAddress>0x4001A000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x3F6</size>
            </addressBlock>
        </peripheral>
        <peripheral derivedFrom="TMR60">
            <name>TMR69</name>
            <description>desc TMR6</description>
            <baseAddress>0x4001A400</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x3F6</size>
            </addressBlock>
        </peripheral>
        <peripheral>
            <name>TRNG</name>
            <description>desc TRNG</description>
            <baseAddress>0x40008800</baseAddress>
            <alternatePeripheral>CRC</alternatePeripheral>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x90</size>
            </addressBlock>
            <registers>
                <register>
                    <name>CR</name>
                    <description>desc CR</description>
                    <addressOffset>0x0</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3</resetMask>
                    <fields>
                        <field>
                            <name>EN</name>
                            <description>desc EN</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RUN</name>
                            <description>desc RUN</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FR</name>
                    <description>desc FR</description>
                    <addressOffset>0x4</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x7800</resetValue>
                    <resetMask>0x7F</resetMask>
                    <fields>
                        <field>
                            <name>LENGTH</name>
                            <description>desc LENGTH</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>XOR</name>
                            <description>desc XOR</description>
                            <msb>6</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SR</name>
                    <description>desc SR</description>
                    <addressOffset>0x8</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x1</resetValue>
                    <resetMask>0x80</resetMask>
                    <fields>
                        <field>
                            <name>STABLE</name>
                            <description>desc STABLE</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IR</name>
                    <description>desc IR</description>
                    <addressOffset>0x28</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1</resetMask>
                    <fields>
                        <field>
                            <name>END</name>
                            <description>desc END</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DR0</name>
                    <description>desc DR0</description>
                    <addressOffset>0x80</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>DR1</name>
                    <description>desc DR1</description>
                    <addressOffset>0x84</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>DR2</name>
                    <description>desc DR2</description>
                    <addressOffset>0x88</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>DR3</name>
                    <description>desc DR3</description>
                    <addressOffset>0x8C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
