RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/EWARM/HDSC_HC32F480.svd
                <register>
                    <name>GRXSTSP</name>
                    <description>desc GRXSTSP</description>
                    <addressOffset>0x20</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x11FFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CHNUM</name>
                            <description>desc CHNUM</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>BCNT</name>
                            <description>desc BCNT</description>
                            <msb>14</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DPID</name>
                            <description>desc DPID</description>
                            <msb>16</msb>
                            <lsb>15</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PKTSTS</name>
                            <description>desc PKTSTS</description>
                            <msb>20</msb>
                            <lsb>17</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RESV</name>
                            <description>desc RESV</description>
                            <msb>24</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GRXFSIZ</name>
                    <description>desc GRXFSIZ</description>
                    <addressOffset>0x24</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x140</resetValue>
                    <resetMask>0x7FF</resetMask>
                    <fields>
                        <field>
                            <name>RXFDEP</name>
                            <description>desc RXFDEP</description>
                            <msb>10</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GNPTXFSIZ</name>
                    <description>desc GNPTXFSIZ</description>
                    <addressOffset>0x28</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x2000140</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>NPTXFSTADDR</name>
                            <description>desc NPTXFSTADDR</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NPTXFDEP</name>
                            <description>desc NPTXFDEP</description>
                            <msb>31</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GNPTXSTS</name>
                    <description>desc GNPTXSTS</description>
                    <addressOffset>0x2C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x80100</resetValue>
                    <resetMask>0x7FFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>NPTXFSPCAVAIL</name>
                            <description>desc NPTXFSPCAVAIL</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>NPTXQSPCAVAIL</name>
                            <description>desc NPTXQSPCAVAIL</description>
                            <msb>23</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>NPTXQTOP</name>
                            <description>desc NPTXQTOP</description>
                            <msb>30</msb>
                            <lsb>24</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPVNDCTL</name>
                    <description>desc GPVNDCTL</description>
                    <addressOffset>0x34</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xE7FFFFF</resetMask>
                    <fields>
                        <field>
                            <name>REGDATA</name>
                            <description>desc REGDATA</description>
                            <msb>7</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VCTRL</name>
                            <description>desc VCTRL</description>
                            <msb>15</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>REGADDR</name>
                            <description>desc REGADDR</description>
                            <msb>21</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>REGWR</name>
                            <description>desc REGWR</description>
                            <msb>22</msb>
                            <lsb>22</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NEWREGREQ</name>
                            <description>desc NEWREGREQ</description>
                            <msb>25</msb>
                            <lsb>25</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VSTSBSY</name>
                            <description>desc VSTSBSY</description>
                            <msb>26</msb>
                            <lsb>26</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>VSTSDONE</name>
                            <description>desc VSTSDONE</description>
                            <msb>27</msb>
                            <lsb>27</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GGPIO</name>
                    <description>desc GGPIO</description>
                    <addressOffset>0x38</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>GPI</name>
                            <description>desc GPI</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>GPO</name>
                            <description>desc GPO</description>
                            <msb>31</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GUID</name>
                    <description>desc GUID</description>
                    <addressOffset>0x3C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x12345678</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>GSNPSID</name>
                    <description>desc GSNPSID</description>
                    <addressOffset>0x40</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x4F54330A</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>GHWCFG1</name>
                    <description>desc GHWCFG1</description>
                    <addressOffset>0x44</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>GHWCFG2</name>
                    <description>desc GHWCFG2</description>
                    <addressOffset>0x48</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x228ED530</resetValue>
                    <resetMask>0x7FDFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>OTGMODE</name>
                            <description>desc OTGMODE</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>OTGARCH</name>
                            <description>desc OTGARCH</description>
                            <msb>4</msb>
                            <lsb>3</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SINGPNT</name>
                            <description>desc SINGPNT</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>HSPHYTYPE</name>
                            <description>desc HSPHYTYPE</description>
                            <msb>7</msb>
                            <lsb>6</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FSPHYTYPE</name>
                            <description>desc FSPHYTYPE</description>
                            <msb>9</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>NUMDEVEPS</name>
                            <description>desc NUMDEVEPS</description>
                            <msb>13</msb>
                            <lsb>10</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>NUMHSTCHNL</name>
                            <description>desc NUMHSTCHNL</description>
                            <msb>17</msb>
                            <lsb>14</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PERIOSUPPORT</name>
                            <description>desc PERIOSUPPORT</description>
                            <msb>18</msb>
                            <lsb>18</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DYNFIFOSIZING</name>
                            <description>desc DYNFIFOSIZING</description>
                            <msb>19</msb>
                            <lsb>19</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MULTIPROCINTRPT</name>
                            <description>desc MULTIPROCINTRPT</description>
                            <msb>20</msb>
                            <lsb>20</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>NPTXQDEPTH</name>
                            <description>desc NPTXQDEPTH</description>
                            <msb>23</msb>
                            <lsb>22</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PTXQDEPTH</name>
                            <description>desc PTXQDEPTH</description>
                            <msb>25</msb>
                            <lsb>24</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TKNQDEPTH</name>
                            <description>desc TKNQDEPTH</description>
                            <msb>30</msb>
                            <lsb>26</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GHWCFG3</name>
                    <description>desc GHWCFG3</description>
                    <addressOffset>0x4C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x13400E8</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>XFERSIZEWIDTH</name>
                            <description>desc XFERSIZEWIDTH</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PKTSIZEWIDTH</name>
                            <description>desc PKTSIZEWIDTH</description>
                            <msb>6</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>OTGEN</name>
                            <description>desc OTGEN</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>I2CINTSEL</name>
                            <description>desc I2CINTSEL</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>VNDCTLSUPT</name>
                            <description>desc VNDCTLSUPT</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>OPTFEATURE</name>
                            <description>desc OPTFEATURE</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RSTTYPE</name>
                            <description>desc RSTTYPE</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ADPSUPPORT</name>
                            <description>desc ADPSUPPORT</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>HSICMODE</name>
                            <description>desc HSICMODE</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>BCSUPPORT</name>
                            <description>desc BCSUPPORT</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>LPMMODE</name>
                            <description>desc LPMMODE</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DFIFODEPTH</name>
                            <description>desc DFIFODEPTH</description>
                            <msb>31</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
