RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/EWARM/HDSC_HC32F480.svd
                <register>
                    <name>DOEPMSK</name>
                    <description>desc DOEPMSK</description>
                    <addressOffset>0x814</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x717F</resetMask>
                    <fields>
                        <field>
                            <name>XFERCOMPLMSK</name>
                            <description>desc XFERCOMPLMSK</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EPDISBLDMSK</name>
                            <description>desc EPDISBLDMSK</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AHBERRMSK</name>
                            <description>desc AHBERRMSK</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SETUPMSK</name>
                            <description>desc SETUPMSK</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OUTTKNEPDISMSK</name>
                            <description>desc OUTTKNEPDISMSK</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>STSPHSERCVDMSK</name>
                            <description>desc STSPHSERCVDMSK</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BACK2BACKSETUP</name>
                            <description>desc BACK2BACKSETUP</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OUTPKTERRMSK</name>
                            <description>desc OUTPKTERRMSK</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BBLEERRMSK</name>
                            <description>desc BBLEERRMSK</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NAKMSK</name>
                            <description>desc NAKMSK</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NYETMSK</name>
                            <description>desc NYETMSK</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DAINT</name>
                    <description>desc DAINT</description>
                    <addressOffset>0x818</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1FF00FF</resetMask>
                    <fields>
                        <field>
                            <name>INEPINT0</name>
                            <description>desc INEPINT0</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>INEPINT1</name>
                            <description>desc INEPINT1</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>INEPINT2</name>
                            <description>desc INEPINT2</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>INEPINT3</name>
                            <description>desc INEPINT3</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>INEPINT4</name>
                            <description>desc INEPINT4</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>INEPINT5</name>
                            <description>desc INEPINT5</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>INEPINT6</name>
                            <description>desc INEPINT6</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>INEPINT7</name>
                            <description>desc INEPINT7</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>OUTEPINT0</name>
                            <description>desc OUTEPINT0</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>OUTEPINT1</name>
                            <description>desc OUTEPINT1</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>OUTEPINT2</name>
                            <description>desc OUTEPINT2</description>
                            <msb>18</msb>
                            <lsb>18</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>OUTEPINT3</name>
                            <description>desc OUTEPINT3</description>
                            <msb>19</msb>
                            <lsb>19</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>OUTEPINT4</name>
                            <description>desc OUTEPINT4</description>
                            <msb>20</msb>
                            <lsb>20</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>OUTEPINT5</name>
                            <description>desc OUTEPINT5</description>
                            <msb>21</msb>
                            <lsb>21</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>OUTEPINT6</name>
                            <description>desc OUTEPINT6</description>
                            <msb>22</msb>
                            <lsb>22</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>OUTEPINT7</name>
                            <description>desc OUTEPINT7</description>
                            <msb>23</msb>
                            <lsb>23</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RESV</name>
                            <description>desc RESV</description>
                            <msb>24</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DAINTMSK</name>
                    <description>desc DAINTMSK</description>
                    <addressOffset>0x81C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1FF00FF</resetMask>
                    <fields>
                        <field>
                            <name>INEPMSK0</name>
                            <description>desc INEPMSK0</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INEPMSK1</name>
                            <description>desc INEPMSK1</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INEPMSK2</name>
                            <description>desc INEPMSK2</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INEPMSK3</name>
                            <description>desc INEPMSK3</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INEPMSK4</name>
                            <description>desc INEPMSK4</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INEPMSK5</name>
                            <description>desc INEPMSK5</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INEPMSK6</name>
                            <description>desc INEPMSK6</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INEPMSK7</name>
                            <description>desc INEPMSK7</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OUTEPMSK0</name>
                            <description>desc OUTEPMSK0</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OUTEPMSK1</name>
                            <description>desc OUTEPMSK1</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OUTEPMSK2</name>
                            <description>desc OUTEPMSK2</description>
                            <msb>18</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OUTEPMSK3</name>
                            <description>desc OUTEPMSK3</description>
                            <msb>19</msb>
                            <lsb>19</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OUTEPMSK4</name>
                            <description>desc OUTEPMSK4</description>
                            <msb>20</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OUTEPMSK5</name>
                            <description>desc OUTEPMSK5</description>
                            <msb>21</msb>
                            <lsb>21</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OUTEPMSK6</name>
                            <description>desc OUTEPMSK6</description>
                            <msb>22</msb>
                            <lsb>22</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OUTEPMSK7</name>
                            <description>desc OUTEPMSK7</description>
                            <msb>23</msb>
                            <lsb>23</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RESV</name>
                            <description>desc RESV</description>
                            <msb>24</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DVBUSDIS</name>
                    <description>desc DVBUSDIS</description>
                    <addressOffset>0x828</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x17D7</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>DVBUSPULSE</name>
                    <description>desc DVBUSPULSE</description>
                    <addressOffset>0x82C</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x5B8</resetValue>
                    <resetMask>0xFFF</resetMask>
                    <fields>
                        <field>
                            <name>DVBUSPULSE</name>
                            <description>desc DVBUSPULSE</description>
                            <msb>11</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DTHRCTL</name>
                    <description>desc DTHRCTL</description>
                    <addressOffset>0x830</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xC100020</resetValue>
                    <resetMask>0xBFF1FFF</resetMask>
                    <fields>
                        <field>
                            <name>NONISOTHREN</name>
                            <description>desc NONISOTHREN</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ISOTHREN</name>
                            <description>desc ISOTHREN</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TXTHRLEN</name>
                            <description>desc TXTHRLEN</description>
                            <msb>10</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AHBTHRRATIO</name>
                            <description>desc AHBTHRRATIO</description>
                            <msb>12</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RXTHREN</name>
                            <description>desc RXTHREN</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RXTHRLEN</name>
                            <description>desc RXTHRLEN</description>
                            <msb>25</msb>
                            <lsb>17</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ARBPRKEN</name>
                            <description>desc ARBPRKEN</description>
                            <msb>27</msb>
                            <lsb>27</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIEPEMPMSK</name>
                    <description>desc DIEPEMPMSK</description>
                    <addressOffset>0x834</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>DIEPCTL0</name>
                    <description>desc DIEPCTL0</description>
                    <addressOffset>0x900</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x8000</resetValue>
                    <resetMask>0xCFEE8003</resetMask>
                    <fields>
                        <field>
                            <name>MPS</name>
                            <description>desc MPS</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>USBACTEP</name>
                            <description>desc USBACTEP</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>NAKSTS</name>
                            <description>desc NAKSTS</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EPTYPE</name>
                            <description>desc EPTYPE</description>
                            <msb>19</msb>
                            <lsb>18</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>STALL</name>
                            <description>desc STALL</description>
                            <msb>21</msb>
                            <lsb>21</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TXFNUM</name>
                            <description>desc TXFNUM</description>
                            <msb>25</msb>
                            <lsb>22</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CNAK</name>
                            <description>desc CNAK</description>
                            <msb>26</msb>
                            <lsb>26</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SNAK</name>
                            <description>desc SNAK</description>
                            <msb>27</msb>
                            <lsb>27</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>EPDIS</name>
                            <description>desc EPDIS</description>
                            <msb>30</msb>
                            <lsb>30</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EPENA</name>
                            <description>desc EPENA</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
