RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/EWARM/HDSC_HC32F480.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>USH</name>
            <description>desc USH</description>
            <baseAddress>0x40080000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0xE02</size>
            </addressBlock>
            <registers>
                <register>
                    <name>GOTGCTL</name>
                    <description>desc GOTGCTL</description>
                    <addressOffset>0x0</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x10000</resetValue>
                    <resetMask>0x13F9FFF</resetMask>
                    <fields>
                        <field>
                            <name>SESREQSCS</name>
                            <description>desc SESREQSCS</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SESREQ</name>
                            <description>desc SESREQ</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VBVALIDOVEN</name>
                            <description>desc VBVALIDOVEN</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VBVALIDOVVAL</name>
                            <description>desc VBVALIDOVVAL</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AVALIDOVEN</name>
                            <description>desc AVALIDOVEN</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AVALIDOVVAL</name>
                            <description>desc AVALIDOVVAL</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BVALIDOVEN</name>
                            <description>desc BVALIDOVEN</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BVALIDOVVAL</name>
                            <description>desc BVALIDOVVAL</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HSTNEGSCS</name>
                            <description>desc HSTNEGSCS</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>HNPREQ</name>
                            <description>desc HNPREQ</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HSTSETHNPEN</name>
                            <description>desc HSTSETHNPEN</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DEVHNPEN</name>
                            <description>desc DEVHNPEN</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EHEN</name>
                            <description>desc EHEN</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DBNCEFLTRBYPASS</name>
                            <description>desc DBNCEFLTRBYPASS</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CONIDSTS</name>
                            <description>desc CONIDSTS</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DBNCTIME</name>
                            <description>desc DBNCTIME</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ASESVLD</name>
                            <description>desc ASESVLD</description>
                            <msb>18</msb>
                            <lsb>18</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>BSESVLD</name>
                            <description>desc BSESVLD</description>
                            <msb>19</msb>
                            <lsb>19</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>OTGVER</name>
                            <description>desc OTGVER</description>
                            <msb>20</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CURMOD</name>
                            <description>desc CURMOD</description>
                            <msb>21</msb>
                            <lsb>21</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RESV</name>
                            <description>desc RESV</description>
                            <msb>24</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GOTGINT</name>
                    <description>desc GOTGINT</description>
                    <addressOffset>0x4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x10E0304</resetMask>
                    <fields>
                        <field>
                            <name>SESENDDET</name>
                            <description>desc SESENDDET</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SESREQSUCSTSCHNG</name>
                            <description>desc SESREQSUCSTSCHNG</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HSTNEGSUCSTSCHNG</name>
                            <description>desc HSTNEGSUCSTSCHNG</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HSTNEGDET</name>
                            <description>desc HSTNEGDET</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ADEVTOUTCHG</name>
                            <description>desc ADEVTOUTCHG</description>
                            <msb>18</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DBNCEDONE</name>
                            <description>desc DBNCEDONE</description>
                            <msb>19</msb>
                            <lsb>19</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RESV</name>
                            <description>desc RESV</description>
                            <msb>24</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GAHBCFG</name>
                    <description>desc GAHBCFG</description>
                    <addressOffset>0x8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1E001BF</resetMask>
                    <fields>
                        <field>
                            <name>GLBLINTRMSK</name>
                            <description>desc GLBLINTRMSK</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HBSTLEN</name>
                            <description>desc HBSTLEN</description>
                            <msb>4</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DMAEN</name>
                            <description>desc DMAEN</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NPTXFEMPLVL</name>
                            <description>desc NPTXFEMPLVL</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PTXFEMPLVL</name>
                            <description>desc PTXFEMPLVL</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>REMMEMSUPP</name>
                            <description>desc REMMEMSUPP</description>
                            <msb>21</msb>
                            <lsb>21</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOTIALLDMAWRIT</name>
                            <description>desc NOTIALLDMAWRIT</description>
                            <msb>22</msb>
                            <lsb>22</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AHBSINGLE</name>
                            <description>desc AHBSINGLE</description>
                            <msb>23</msb>
                            <lsb>23</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RESV</name>
                            <description>desc RESV</description>
                            <msb>24</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GUSBCFG</name>
                    <description>desc GUSBCFG</description>
                    <addressOffset>0xC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1410</resetValue>
                    <resetMask>0xF7FE3FFF</resetMask>
                    <fields>
                        <field>
                            <name>TOUTCAL</name>
                            <description>desc TOUTCAL</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PHYIF</name>
                            <description>desc PHYIF</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ULPI_UTMI_SEL</name>
                            <description>desc ULPI_UTMI_SEL</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FSINTF</name>
                            <description>desc FSINTF</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PHYSEL</name>
                            <description>desc PHYSEL</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DDRSEL</name>
                            <description>desc DDRSEL</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SRPCAP</name>
                            <description>desc SRPCAP</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HNPCAP</name>
                            <description>desc HNPCAP</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USBTRDTIM</name>
                            <description>desc USBTRDTIM</description>
                            <msb>13</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ULPIFSLS</name>
                            <description>desc ULPIFSLS</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ULPIAUTORES</name>
                            <description>desc ULPIAUTORES</description>
                            <msb>18</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ULPICLKSUSM</name>
                            <description>desc ULPICLKSUSM</description>
                            <msb>19</msb>
                            <lsb>19</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ULPIEXTVBUSDRV</name>
                            <description>desc ULPIEXTVBUSDRV</description>
                            <msb>20</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ULPIEXTVBUSINDICATOR</name>
                            <description>desc ULPIEXTVBUSINDICATOR</description>
                            <msb>21</msb>
                            <lsb>21</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TERMSELDLPULSE</name>
                            <description>desc TERMSELDLPULSE</description>
                            <msb>22</msb>
                            <lsb>22</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>COMPLEMENT</name>
                            <description>desc COMPLEMENT</description>
                            <msb>23</msb>
                            <lsb>23</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INDICATOR</name>
                            <description>desc INDICATOR</description>
                            <msb>24</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ULPI</name>
                            <description>desc ULPI</description>
                            <msb>25</msb>
                            <lsb>25</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IC_USBCAP</name>
                            <description>desc IC_USBCAP</description>
                            <msb>26</msb>
                            <lsb>26</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TXENDDELAY</name>
                            <description>desc TXENDDELAY</description>
                            <msb>28</msb>
                            <lsb>28</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FORCEHSTMODE</name>
                            <description>desc FORCEHSTMODE</description>
                            <msb>29</msb>
                            <lsb>29</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FORCEDEVMODE</name>
                            <description>desc FORCEDEVMODE</description>
                            <msb>30</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CORRUPTTXPKT</name>
                            <description>desc CORRUPTTXPKT</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
