RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/EWARM/HDSC_HC32F480.svd
                <register>
                    <name>GRSTCTL</name>
                    <description>desc GRSTCTL</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x80000000</resetValue>
                    <resetMask>0xC00007F7</resetMask>
                    <fields>
                        <field>
                            <name>CSFTRST</name>
                            <description>desc CSFTRST</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PIUFSSFTRST</name>
                            <description>desc PIUFSSFTRST</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FRMCNTRRST</name>
                            <description>desc FRMCNTRRST</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RXFFLSH</name>
                            <description>desc RXFFLSH</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TXFFLSH</name>
                            <description>desc TXFFLSH</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TXFNUM</name>
                            <description>desc TXFNUM</description>
                            <msb>10</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DMAREQ</name>
                            <description>desc DMAREQ</description>
                            <msb>30</msb>
                            <lsb>30</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>AHBIDLE</name>
                            <description>desc AHBIDLE</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GINTSTS</name>
                    <description>desc GINTSTS</description>
                    <addressOffset>0x14</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x14000020</resetValue>
                    <resetMask>0xF7FEFCFF</resetMask>
                    <fields>
                        <field>
                            <name>CURMOD</name>
                            <description>desc CURMOD</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MODEMIS</name>
                            <description>desc MODEMIS</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OTGINT</name>
                            <description>desc OTGINT</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SOF</name>
                            <description>desc SOF</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RXFLVL</name>
                            <description>desc RXFLVL</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>NPTXFEMP</name>
                            <description>desc NPTXFEMP</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>GINNAKEFF</name>
                            <description>desc GINNAKEFF</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>GOUTNAKEFF</name>
                            <description>desc GOUTNAKEFF</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ERLYSUSP</name>
                            <description>desc ERLYSUSP</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USBSUSP</name>
                            <description>desc USBSUSP</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USBRST</name>
                            <description>desc USBRST</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ENUMDONE</name>
                            <description>desc ENUMDONE</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ISOOUTDROP</name>
                            <description>desc ISOOUTDROP</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EOPF</name>
                            <description>desc EOPF</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EPMIS</name>
                            <description>desc EPMIS</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IEPINT</name>
                            <description>desc IEPINT</description>
                            <msb>18</msb>
                            <lsb>18</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>OEPINT</name>
                            <description>desc OEPINT</description>
                            <msb>19</msb>
                            <lsb>19</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>INCOMPISOIN</name>
                            <description>desc INCOMPISOIN</description>
                            <msb>20</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INCOMPLP</name>
                            <description>desc INCOMPLP</description>
                            <msb>21</msb>
                            <lsb>21</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FETSUSP</name>
                            <description>desc FETSUSP</description>
                            <msb>22</msb>
                            <lsb>22</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RESETDET</name>
                            <description>desc RESETDET</description>
                            <msb>23</msb>
                            <lsb>23</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PRTINT</name>
                            <description>desc PRTINT</description>
                            <msb>24</msb>
                            <lsb>24</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>HCHINT</name>
                            <description>desc HCHINT</description>
                            <msb>25</msb>
                            <lsb>25</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PTXFEMP</name>
                            <description>desc PTXFEMP</description>
                            <msb>26</msb>
                            <lsb>26</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CONIDSTSCHNG</name>
                            <description>desc CONIDSTSCHNG</description>
                            <msb>28</msb>
                            <lsb>28</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DISCONNINT</name>
                            <description>desc DISCONNINT</description>
                            <msb>29</msb>
                            <lsb>29</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SESSREQINT</name>
                            <description>desc SESSREQINT</description>
                            <msb>30</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WKUPINT</name>
                            <description>desc WKUPINT</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GINTMSK</name>
                    <description>desc GINTMSK</description>
                    <addressOffset>0x18</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xF7FEFCFE</resetMask>
                    <fields>
                        <field>
                            <name>MODEMISMSK</name>
                            <description>desc MODEMISMSK</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OTGINTMSK</name>
                            <description>desc OTGINTMSK</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SOFMSK</name>
                            <description>desc SOFMSK</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RXFLVLMSK</name>
                            <description>desc RXFLVLMSK</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NPTXFEMPMSK</name>
                            <description>desc NPTXFEMPMSK</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GINNAKEFFMSK</name>
                            <description>desc GINNAKEFFMSK</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GOUTNAKEFFMSK</name>
                            <description>desc GOUTNAKEFFMSK</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ERLYSUSPMSK</name>
                            <description>desc ERLYSUSPMSK</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USBSUSPMSK</name>
                            <description>desc USBSUSPMSK</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USBRSTMSK</name>
                            <description>desc USBRSTMSK</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ENUMDONEMSK</name>
                            <description>desc ENUMDONEMSK</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ISOOUTDROPMSK</name>
                            <description>desc ISOOUTDROPMSK</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EOPFMSK</name>
                            <description>desc EOPFMSK</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EPMISMSK</name>
                            <description>desc EPMISMSK</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IEPINTMSK</name>
                            <description>desc IEPINTMSK</description>
                            <msb>18</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OEPINTMSK</name>
                            <description>desc OEPINTMSK</description>
                            <msb>19</msb>
                            <lsb>19</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INCOMPISOINMSK</name>
                            <description>desc INCOMPISOINMSK</description>
                            <msb>20</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INCOMPLPMSK</name>
                            <description>desc INCOMPLPMSK</description>
                            <msb>21</msb>
                            <lsb>21</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FETSUSPMSK</name>
                            <description>desc FETSUSPMSK</description>
                            <msb>22</msb>
                            <lsb>22</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RESETDETMSK</name>
                            <description>desc RESETDETMSK</description>
                            <msb>23</msb>
                            <lsb>23</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PRTINTMSK</name>
                            <description>desc PRTINTMSK</description>
                            <msb>24</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HCHINTMSK</name>
                            <description>desc HCHINTMSK</description>
                            <msb>25</msb>
                            <lsb>25</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PTXFEMPMSK</name>
                            <description>desc PTXFEMPMSK</description>
                            <msb>26</msb>
                            <lsb>26</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CONIDSTSCHNGMSK</name>
                            <description>desc CONIDSTSCHNGMSK</description>
                            <msb>28</msb>
                            <lsb>28</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DISCONNINTMSK</name>
                            <description>desc DISCONNINTMSK</description>
                            <msb>29</msb>
                            <lsb>29</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SESSREQINTMSK</name>
                            <description>desc SESSREQINTMSK</description>
                            <msb>30</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WKUPINTMSK</name>
                            <description>desc WKUPINTMSK</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GRXSTSR</name>
                    <description>desc GRXSTSR</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x11FFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CHNUM</name>
                            <description>desc CHNUM</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>BCNT</name>
                            <description>desc BCNT</description>
                            <msb>14</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DPID</name>
                            <description>desc DPID</description>
                            <msb>16</msb>
                            <lsb>15</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PKTSTS</name>
                            <description>desc PKTSTS</description>
                            <msb>20</msb>
                            <lsb>17</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RESV</name>
                            <description>desc RESV</description>
                            <msb>24</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
