RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/EWARM/HDSC_HC32F480.svd
                <register>
                    <name>GHWCFG4</name>
                    <description>desc GHWCFG4</description>
                    <addressOffset>0x50</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x1FF00030</resetValue>
                    <resetMask>0xFFFFC0FF</resetMask>
                    <fields>
                        <field>
                            <name>NUMDEVPERIOEPS</name>
                            <description>desc NUMDEVPERIOEPS</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PARTIALPWRDN</name>
                            <description>desc PARTIALPWRDN</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>AHBFREQ</name>
                            <description>desc AHBFREQ</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>HIBERNATION</name>
                            <description>desc HIBERNATION</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EXTENDEDHIBERNATION</name>
                            <description>desc EXTENDEDHIBERNATION</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PHYDATAWIDTH</name>
                            <description>desc PHYDATAWIDTH</description>
                            <msb>15</msb>
                            <lsb>14</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>NUMCTLEPS</name>
                            <description>desc NUMCTLEPS</description>
                            <msb>19</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>IDDGFLTR</name>
                            <description>desc IDDGFLTR</description>
                            <msb>20</msb>
                            <lsb>20</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>VBUSVALIDFLTR</name>
                            <description>desc VBUSVALIDFLTR</description>
                            <msb>21</msb>
                            <lsb>21</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>AVALIDFLTR</name>
                            <description>desc AVALIDFLTR</description>
                            <msb>22</msb>
                            <lsb>22</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>BVALIDFLTR</name>
                            <description>desc BVALIDFLTR</description>
                            <msb>23</msb>
                            <lsb>23</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SESSENDFLTR</name>
                            <description>desc SESSENDFLTR</description>
                            <msb>24</msb>
                            <lsb>24</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DEDFIFOMODE</name>
                            <description>desc DEDFIFOMODE</description>
                            <msb>25</msb>
                            <lsb>25</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>INEPS</name>
                            <description>desc INEPS</description>
                            <msb>29</msb>
                            <lsb>26</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DESCDMAENABLED</name>
                            <description>desc DESCDMAENABLED</description>
                            <msb>30</msb>
                            <lsb>30</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DESCDMA</name>
                            <description>desc DESCDMA</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GDFIFOCFG</name>
                    <description>desc GDFIFOCFG</description>
                    <addressOffset>0x5C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x3F00400</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>GDFIFOCFG</name>
                            <description>desc GDFIFOCFG</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EPINFOBASEADDR</name>
                            <description>desc EPINFOBASEADDR</description>
                            <msb>31</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HPTXFSIZ</name>
                    <description>desc HPTXFSIZ</description>
                    <addressOffset>0x100</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7FF0FFF</resetMask>
                    <fields>
                        <field>
                            <name>PTXFSTADDR</name>
                            <description>desc PTXFSTADDR</description>
                            <msb>11</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PTXFSIZE</name>
                            <description>desc PTXFSIZE</description>
                            <msb>26</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIEPTXF1</name>
                    <description>desc DIEPTXF1</description>
                    <addressOffset>0x104</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x2000600</resetValue>
                    <resetMask>0x3FF07FF</resetMask>
                    <fields>
                        <field>
                            <name>INEPNTXFSTADDR</name>
                            <description>desc INEPNTXFSTADDR</description>
                            <msb>10</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INEPNTXFDEP</name>
                            <description>desc INEPNTXFDEP</description>
                            <msb>25</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIEPTXF2</name>
                    <description>desc DIEPTXF2</description>
                    <addressOffset>0x108</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x2000800</resetValue>
                    <resetMask>0x3FF0FFF</resetMask>
                    <fields>
                        <field>
                            <name>INEPNTXFSTADDR</name>
                            <description>desc INEPNTXFSTADDR</description>
                            <msb>11</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INEPNTXFDEP</name>
                            <description>desc INEPNTXFDEP</description>
                            <msb>25</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIEPTXF3</name>
                    <description>desc DIEPTXF3</description>
                    <addressOffset>0x10C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x2000A00</resetValue>
                    <resetMask>0x3FF0FFF</resetMask>
                    <fields>
                        <field>
                            <name>INEPNTXFSTADDR</name>
                            <description>desc INEPNTXFSTADDR</description>
                            <msb>11</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INEPNTXFDEP</name>
                            <description>desc INEPNTXFDEP</description>
                            <msb>25</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIEPTXF4</name>
                    <description>desc DIEPTXF4</description>
                    <addressOffset>0x110</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x2000C00</resetValue>
                    <resetMask>0x3FF0FFF</resetMask>
                    <fields>
                        <field>
                            <name>INEPNTXFSTADDR</name>
                            <description>desc INEPNTXFSTADDR</description>
                            <msb>11</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INEPNTXFDEP</name>
                            <description>desc INEPNTXFDEP</description>
                            <msb>25</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIEPTXF5</name>
                    <description>desc DIEPTXF5</description>
                    <addressOffset>0x114</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x2000E00</resetValue>
                    <resetMask>0x3FF0FFF</resetMask>
                    <fields>
                        <field>
                            <name>INEPNTXFSTADDR</name>
                            <description>desc INEPNTXFSTADDR</description>
                            <msb>11</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INEPNTXFDEP</name>
                            <description>desc INEPNTXFDEP</description>
                            <msb>25</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIEPTXF6</name>
                    <description>desc DIEPTXF6</description>
                    <addressOffset>0x118</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x2001000</resetValue>
                    <resetMask>0x3FF1FFF</resetMask>
                    <fields>
                        <field>
                            <name>INEPNTXFSTADDR</name>
                            <description>desc INEPNTXFSTADDR</description>
                            <msb>12</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INEPNTXFDEP</name>
                            <description>desc INEPNTXFDEP</description>
                            <msb>25</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIEPTXF7</name>
                    <description>desc DIEPTXF7</description>
                    <addressOffset>0x11C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x2001200</resetValue>
                    <resetMask>0x3FF1FFF</resetMask>
                    <fields>
                        <field>
                            <name>INEPNTXFSTADDR</name>
                            <description>desc INEPNTXFSTADDR</description>
                            <msb>12</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INEPNTXFDEP</name>
                            <description>desc INEPNTXFDEP</description>
                            <msb>25</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCFG</name>
                    <description>desc HCFG</description>
                    <addressOffset>0x400</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x200000</resetValue>
                    <resetMask>0x8000FF87</resetMask>
                    <fields>
                        <field>
                            <name>FSLSPCLKSEL</name>
                            <description>desc FSLSPCLKSEL</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FSLSSUPP</name>
                            <description>desc FSLSSUPP</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ENA32KHZS</name>
                            <description>desc ENA32KHZS</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RESVALID</name>
                            <description>desc RESVALID</description>
                            <msb>15</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MODECHTIMEN</name>
                            <description>desc MODECHTIMEN</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HFIR</name>
                    <description>desc HFIR</description>
                    <addressOffset>0x404</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x17D7</resetValue>
                    <resetMask>0x101FFFF</resetMask>
                    <fields>
                        <field>
                            <name>FRINT</name>
                            <description>desc FRINT</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HFIRRLDCTRL</name>
                            <description>desc HFIRRLDCTRL</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RESV</name>
                            <description>desc RESV</description>
                            <msb>24</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HFNUM</name>
                    <description>desc HFNUM</description>
                    <addressOffset>0x408</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>FRNUM</name>
                            <description>desc FRNUM</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FRREM</name>
                            <description>desc FRREM</description>
                            <msb>31</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HPTXSTS</name>
                    <description>desc HPTXSTS</description>
                    <addressOffset>0x410</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x80200</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PTXFSPCAVAIL</name>
                            <description>desc PTXFSPCAVAIL</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PTXQSPCAVAIL</name>
                            <description>desc PTXQSPCAVAIL</description>
                            <msb>23</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PTXQTOP</name>
                            <description>desc PTXQTOP</description>
                            <msb>31</msb>
                            <lsb>24</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HAINT</name>
                    <description>desc HAINT</description>
                    <addressOffset>0x414</addressOffset>
                    <size>16</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>HAINTMSK</name>
                    <description>desc HAINTMSK</description>
                    <addressOffset>0x418</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
