RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/EWARM/HDSC_HC32F480.svd
                <register>
                    <name>HCTSIZ15</name>
                    <description>desc HCTSIZ15</description>
                    <addressOffset>0x6F0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>XFERSIZE</name>
                            <description>desc XFERSIZE</description>
                            <msb>18</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PKTCNT</name>
                            <description>desc PKTCNT</description>
                            <msb>28</msb>
                            <lsb>19</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PID</name>
                            <description>desc PID</description>
                            <msb>30</msb>
                            <lsb>29</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DOPNG</name>
                            <description>desc DOPNG</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCDMA15</name>
                    <description>desc HCDMA15</description>
                    <addressOffset>0x6F4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>DCFG</name>
                    <description>desc DCFG</description>
                    <addressOffset>0x800</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x8200000</resetValue>
                    <resetMask>0x300FFFF</resetMask>
                    <fields>
                        <field>
                            <name>DEVSPD</name>
                            <description>desc DEVSPD</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NZSTSOUTHSHK</name>
                            <description>desc NZSTSOUTHSHK</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ENA32KHZSUSP</name>
                            <description>desc ENA32KHZSUSP</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DEVADDR</name>
                            <description>desc DEVADDR</description>
                            <msb>10</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PERFRINT</name>
                            <description>desc PERFRINT</description>
                            <msb>12</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ENDEVOUTNAK</name>
                            <description>desc ENDEVOUTNAK</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>XCVRDLY</name>
                            <description>desc XCVRDLY</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ERRATICINTMSK</name>
                            <description>desc ERRATICINTMSK</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PERSCHINTVL</name>
                            <description>desc PERSCHINTVL</description>
                            <msb>25</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DCTL</name>
                    <description>desc DCTL</description>
                    <addressOffset>0x804</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x2</resetValue>
                    <resetMask>0x1018FFF</resetMask>
                    <fields>
                        <field>
                            <name>RMTWKUPSIG</name>
                            <description>desc RMTWKUPSIG</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SFTDISCON</name>
                            <description>desc SFTDISCON</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GNPINNAKSTS</name>
                            <description>desc GNPINNAKSTS</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>GOUTNAKSTS</name>
                            <description>desc GOUTNAKSTS</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TSTCTL</name>
                            <description>desc TSTCTL</description>
                            <msb>6</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SGNPINNAK</name>
                            <description>desc SGNPINNAK</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CGNPINNAK</name>
                            <description>desc CGNPINNAK</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SGOUTNAK</name>
                            <description>desc SGOUTNAK</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CGOUTNAK</name>
                            <description>desc CGOUTNAK</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>PWRONPRGDONE</name>
                            <description>desc PWRONPRGDONE</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IGNRFRMNUM</name>
                            <description>desc IGNRFRMNUM</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NAKONBBLE</name>
                            <description>desc NAKONBBLE</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RESV</name>
                            <description>desc RESV</description>
                            <msb>24</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DSTS</name>
                    <description>desc DSTS</description>
                    <addressOffset>0x808</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x2</resetValue>
                    <resetMask>0x1FFFF0F</resetMask>
                    <fields>
                        <field>
                            <name>SUSPSTS</name>
                            <description>desc SUSPSTS</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ENUMSPD</name>
                            <description>desc ENUMSPD</description>
                            <msb>2</msb>
                            <lsb>1</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ERRTICERR</name>
                            <description>desc ERRTICERR</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SOFFN</name>
                            <description>desc SOFFN</description>
                            <msb>21</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DEVLNSTS</name>
                            <description>desc DEVLNSTS</description>
                            <msb>23</msb>
                            <lsb>22</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RESV</name>
                            <description>desc RESV</description>
                            <msb>24</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIEPMSK</name>
                    <description>desc DIEPMSK</description>
                    <addressOffset>0x810</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x217F</resetMask>
                    <fields>
                        <field>
                            <name>XFERCOMPLMSK</name>
                            <description>desc XFERCOMPLMSK</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EPDISBLDMSK</name>
                            <description>desc EPDISBLDMSK</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AHBERRMSK</name>
                            <description>desc AHBERRMSK</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMEOUTMSK</name>
                            <description>desc TIMEOUTMSK</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INTKNTXFEMPMSK</name>
                            <description>desc INTKNTXFEMPMSK</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INTKNEPMISMSK</name>
                            <description>desc INTKNEPMISMSK</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INEPNAKEFFMSK</name>
                            <description>desc INEPNAKEFFMSK</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TXFIFOUNDRNMSK</name>
                            <description>desc TXFIFOUNDRNMSK</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NAKMSK</name>
                            <description>desc NAKMSK</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DOEPMSK</name>
                    <description>desc DOEPMSK</description>
                    <addressOffset>0x814</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x717F</resetMask>
                    <fields>
                        <field>
                            <name>XFERCOMPLMSK</name>
                            <description>desc XFERCOMPLMSK</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EPDISBLDMSK</name>
                            <description>desc EPDISBLDMSK</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AHBERRMSK</name>
                            <description>desc AHBERRMSK</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SETUPMSK</name>
                            <description>desc SETUPMSK</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OUTTKNEPDISMSK</name>
                            <description>desc OUTTKNEPDISMSK</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>STSPHSERCVDMSK</name>
                            <description>desc STSPHSERCVDMSK</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BACK2BACKSETUP</name>
                            <description>desc BACK2BACKSETUP</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OUTPKTERRMSK</name>
                            <description>desc OUTPKTERRMSK</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BBLEERRMSK</name>
                            <description>desc BBLEERRMSK</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NAKMSK</name>
                            <description>desc NAKMSK</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NYETMSK</name>
                            <description>desc NYETMSK</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
