RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/EWARM/HDSC_HC32F480.svd
                <register>
                    <name>DIEPINT2</name>
                    <description>desc DIEPINT2</description>
                    <addressOffset>0x948</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x80</resetValue>
                    <resetMask>0x7BFF</resetMask>
                    <fields>
                        <field>
                            <name>XFERCOMPL</name>
                            <description>desc XFERCOMPL</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EPDISBLD</name>
                            <description>desc EPDISBLD</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AHBERR</name>
                            <description>desc AHBERR</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMEOUT</name>
                            <description>desc TIMEOUT</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INTKNTXFEMP</name>
                            <description>desc INTKNTXFEMP</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INTKNEPMIS</name>
                            <description>desc INTKNEPMIS</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INEPNAKEFF</name>
                            <description>desc INEPNAKEFF</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TXFEMP</name>
                            <description>desc TXFEMP</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TXFIFOUNDRN</name>
                            <description>desc TXFIFOUNDRN</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BNAINTR</name>
                            <description>desc BNAINTR</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PKTDRPSTS</name>
                            <description>desc PKTDRPSTS</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BBLEERR</name>
                            <description>desc BBLEERR</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NAKINTRPT</name>
                            <description>desc NAKINTRPT</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NYETINTRPT</name>
                            <description>desc NYETINTRPT</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIEPTSIZ2</name>
                    <description>desc DIEPTSIZ2</description>
                    <addressOffset>0x950</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7FFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>XFERSIZE</name>
                            <description>desc XFERSIZE</description>
                            <msb>18</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PKTCNT</name>
                            <description>desc PKTCNT</description>
                            <msb>28</msb>
                            <lsb>19</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MC</name>
                            <description>desc MC</description>
                            <msb>30</msb>
                            <lsb>29</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIEPDMA2</name>
                    <description>desc DIEPDMA2</description>
                    <addressOffset>0x954</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>DTXFSTS2</name>
                    <description>desc DTXFSTS2</description>
                    <addressOffset>0x958</addressOffset>
                    <size>16</size>
                    <access>read-only</access>
                    <resetValue>0x200</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>DIEPCTL3</name>
                    <description>desc DIEPCTL3</description>
                    <addressOffset>0x960</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFEF87FF</resetMask>
                    <fields>
                        <field>
                            <name>MPS</name>
                            <description>desc MPS</description>
                            <msb>10</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USBACTEP</name>
                            <description>desc USBACTEP</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DPID</name>
                            <description>desc DPID</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>NAKSTS</name>
                            <description>desc NAKSTS</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EPTYPE</name>
                            <description>desc EPTYPE</description>
                            <msb>19</msb>
                            <lsb>18</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>STALL</name>
                            <description>desc STALL</description>
                            <msb>21</msb>
                            <lsb>21</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TXFNUM</name>
                            <description>desc TXFNUM</description>
                            <msb>25</msb>
                            <lsb>22</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CNAK</name>
                            <description>desc CNAK</description>
                            <msb>26</msb>
                            <lsb>26</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SNAK</name>
                            <description>desc SNAK</description>
                            <msb>27</msb>
                            <lsb>27</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SETD0PID</name>
                            <description>desc SETD0PID</description>
                            <msb>28</msb>
                            <lsb>28</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SETD1PID</name>
                            <description>desc SETD1PID</description>
                            <msb>29</msb>
                            <lsb>29</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>EPDIS</name>
                            <description>desc EPDIS</description>
                            <msb>30</msb>
                            <lsb>30</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EPENA</name>
                            <description>desc EPENA</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIEPINT3</name>
                    <description>desc DIEPINT3</description>
                    <addressOffset>0x968</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x80</resetValue>
                    <resetMask>0x7BFF</resetMask>
                    <fields>
                        <field>
                            <name>XFERCOMPL</name>
                            <description>desc XFERCOMPL</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EPDISBLD</name>
                            <description>desc EPDISBLD</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AHBERR</name>
                            <description>desc AHBERR</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMEOUT</name>
                            <description>desc TIMEOUT</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INTKNTXFEMP</name>
                            <description>desc INTKNTXFEMP</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INTKNEPMIS</name>
                            <description>desc INTKNEPMIS</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INEPNAKEFF</name>
                            <description>desc INEPNAKEFF</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TXFEMP</name>
                            <description>desc TXFEMP</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TXFIFOUNDRN</name>
                            <description>desc TXFIFOUNDRN</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BNAINTR</name>
                            <description>desc BNAINTR</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PKTDRPSTS</name>
                            <description>desc PKTDRPSTS</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BBLEERR</name>
                            <description>desc BBLEERR</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NAKINTRPT</name>
                            <description>desc NAKINTRPT</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NYETINTRPT</name>
                            <description>desc NYETINTRPT</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIEPTSIZ3</name>
                    <description>desc DIEPTSIZ3</description>
                    <addressOffset>0x970</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7FFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>XFERSIZE</name>
                            <description>desc XFERSIZE</description>
                            <msb>18</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PKTCNT</name>
                            <description>desc PKTCNT</description>
                            <msb>28</msb>
                            <lsb>19</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MC</name>
                            <description>desc MC</description>
                            <msb>30</msb>
                            <lsb>29</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIEPDMA3</name>
                    <description>desc DIEPDMA3</description>
                    <addressOffset>0x974</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>DTXFSTS3</name>
                    <description>desc DTXFSTS3</description>
                    <addressOffset>0x978</addressOffset>
                    <size>16</size>
                    <access>read-only</access>
                    <resetValue>0x200</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>DIEPCTL4</name>
                    <description>desc DIEPCTL4</description>
                    <addressOffset>0x980</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFEF87FF</resetMask>
                    <fields>
                        <field>
                            <name>MPS</name>
                            <description>desc MPS</description>
                            <msb>10</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USBACTEP</name>
                            <description>desc USBACTEP</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DPID</name>
                            <description>desc DPID</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>NAKSTS</name>
                            <description>desc NAKSTS</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EPTYPE</name>
                            <description>desc EPTYPE</description>
                            <msb>19</msb>
                            <lsb>18</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>STALL</name>
                            <description>desc STALL</description>
                            <msb>21</msb>
                            <lsb>21</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TXFNUM</name>
                            <description>desc TXFNUM</description>
                            <msb>25</msb>
                            <lsb>22</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CNAK</name>
                            <description>desc CNAK</description>
                            <msb>26</msb>
                            <lsb>26</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SNAK</name>
                            <description>desc SNAK</description>
                            <msb>27</msb>
                            <lsb>27</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SETD0PID</name>
                            <description>desc SETD0PID</description>
                            <msb>28</msb>
                            <lsb>28</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SETD1PID</name>
                            <description>desc SETD1PID</description>
                            <msb>29</msb>
                            <lsb>29</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>EPDIS</name>
                            <description>desc EPDIS</description>
                            <msb>30</msb>
                            <lsb>30</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EPENA</name>
                            <description>desc EPENA</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
