RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/EWARM/HDSC_HC32F480.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>VBAT</name>
            <description>desc VBAT</description>
            <baseAddress>0x4004B800</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x100</size>
            </addressBlock>
            <registers>
                <register>
                    <name>CMU_XTAL32CR</name>
                    <description>desc CMU_XTAL32CR</description>
                    <addressOffset>0x0</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1</resetMask>
                    <fields>
                        <field>
                            <name>XTAL32STP</name>
                            <description>desc XTAL32STP</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CMU_XTAL32CFGR</name>
                    <description>desc CMU_XTAL32CFGR</description>
                    <addressOffset>0x1</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7</resetMask>
                    <fields>
                        <field>
                            <name>XTAL32DRV</name>
                            <description>desc XTAL32DRV</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>XTAL32SUPDRV</name>
                            <description>desc XTAL32SUPDRV</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CMU_XTAL32NFR</name>
                    <description>desc CMU_XTAL32NFR</description>
                    <addressOffset>0x5</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3</resetMask>
                    <fields>
                        <field>
                            <name>XTAL32NF</name>
                            <description>desc XTAL32NF</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>VBATRSTR</name>
                    <description>desc VBATRSTR</description>
                    <addressOffset>0x6</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>CMU_LRCCR</name>
                    <description>desc CMU_LRCCR</description>
                    <addressOffset>0x10</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1</resetMask>
                    <fields>
                        <field>
                            <name>LRCSTP</name>
                            <description>desc LRCSTP</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CMU_RTCLRCCR</name>
                    <description>desc CMU_RTCLRCCR</description>
                    <addressOffset>0x11</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x1</resetValue>
                    <resetMask>0x1</resetMask>
                    <fields>
                        <field>
                            <name>RTCLRCSTP</name>
                            <description>desc RTCLRCSTP</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CMU_LRCTRM</name>
                    <description>desc CMU_LRCTRM</description>
                    <addressOffset>0x12</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>CMU_RTCLRCTRM</name>
                    <description>desc CMU_RTCLRCTRM</description>
                    <addressOffset>0x13</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>BRAMC0</name>
                    <description>desc BRAMC0</description>
                    <addressOffset>0x3A</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7</resetMask>
                    <fields>
                        <field>
                            <name>RAMPWDN</name>
                            <description>desc RAMPWDN</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RAMVALID</name>
                            <description>desc RAMVALID</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RAMPDFLG</name>
                            <description>desc RAMPDFLG</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>VBTBKR0</name>
                    <description>desc VBTBKR0</description>
                    <addressOffset>0x80</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR1</name>
                    <description>desc VBTBKR1</description>
                    <addressOffset>0x81</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR2</name>
                    <description>desc VBTBKR2</description>
                    <addressOffset>0x82</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR3</name>
                    <description>desc VBTBKR3</description>
                    <addressOffset>0x83</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR4</name>
                    <description>desc VBTBKR4</description>
                    <addressOffset>0x84</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR5</name>
                    <description>desc VBTBKR5</description>
                    <addressOffset>0x85</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR6</name>
                    <description>desc VBTBKR6</description>
                    <addressOffset>0x86</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR7</name>
                    <description>desc VBTBKR7</description>
                    <addressOffset>0x87</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR8</name>
                    <description>desc VBTBKR8</description>
                    <addressOffset>0x88</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR9</name>
                    <description>desc VBTBKR9</description>
                    <addressOffset>0x89</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR10</name>
                    <description>desc VBTBKR10</description>
                    <addressOffset>0x8A</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR11</name>
                    <description>desc VBTBKR11</description>
                    <addressOffset>0x8B</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR12</name>
                    <description>desc VBTBKR12</description>
                    <addressOffset>0x8C</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR13</name>
                    <description>desc VBTBKR13</description>
                    <addressOffset>0x8D</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR14</name>
                    <description>desc VBTBKR14</description>
                    <addressOffset>0x8E</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR15</name>
                    <description>desc VBTBKR15</description>
                    <addressOffset>0x8F</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR16</name>
                    <description>desc VBTBKR16</description>
                    <addressOffset>0x90</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR17</name>
                    <description>desc VBTBKR17</description>
                    <addressOffset>0x91</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR18</name>
                    <description>desc VBTBKR18</description>
                    <addressOffset>0x92</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR19</name>
                    <description>desc VBTBKR19</description>
                    <addressOffset>0x93</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR20</name>
                    <description>desc VBTBKR20</description>
                    <addressOffset>0x94</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR21</name>
                    <description>desc VBTBKR21</description>
                    <addressOffset>0x95</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR22</name>
                    <description>desc VBTBKR22</description>
                    <addressOffset>0x96</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR23</name>
                    <description>desc VBTBKR23</description>
                    <addressOffset>0x97</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR24</name>
                    <description>desc VBTBKR24</description>
                    <addressOffset>0x98</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR25</name>
                    <description>desc VBTBKR25</description>
                    <addressOffset>0x99</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR26</name>
                    <description>desc VBTBKR26</description>
                    <addressOffset>0x9A</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR27</name>
                    <description>desc VBTBKR27</description>
                    <addressOffset>0x9B</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR28</name>
                    <description>desc VBTBKR28</description>
                    <addressOffset>0x9C</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR29</name>
                    <description>desc VBTBKR29</description>
                    <addressOffset>0x9D</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR30</name>
                    <description>desc VBTBKR30</description>
                    <addressOffset>0x9E</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR31</name>
                    <description>desc VBTBKR31</description>
                    <addressOffset>0x9F</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR32</name>
                    <description>desc VBTBKR32</description>
                    <addressOffset>0xA0</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR33</name>
                    <description>desc VBTBKR33</description>
                    <addressOffset>0xA1</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR34</name>
                    <description>desc VBTBKR34</description>
                    <addressOffset>0xA2</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR35</name>
                    <description>desc VBTBKR35</description>
                    <addressOffset>0xA3</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR36</name>
                    <description>desc VBTBKR36</description>
                    <addressOffset>0xA4</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR37</name>
                    <description>desc VBTBKR37</description>
                    <addressOffset>0xA5</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR38</name>
                    <description>desc VBTBKR38</description>
                    <addressOffset>0xA6</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR39</name>
                    <description>desc VBTBKR39</description>
                    <addressOffset>0xA7</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR40</name>
                    <description>desc VBTBKR40</description>
                    <addressOffset>0xA8</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR41</name>
                    <description>desc VBTBKR41</description>
                    <addressOffset>0xA9</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
