RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/EWARM/HDSC_HC32F480.svd
                <register>
                    <name>VBTBKR42</name>
                    <description>desc VBTBKR42</description>
                    <addressOffset>0xAA</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR43</name>
                    <description>desc VBTBKR43</description>
                    <addressOffset>0xAB</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR44</name>
                    <description>desc VBTBKR44</description>
                    <addressOffset>0xAC</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR45</name>
                    <description>desc VBTBKR45</description>
                    <addressOffset>0xAD</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR46</name>
                    <description>desc VBTBKR46</description>
                    <addressOffset>0xAE</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR47</name>
                    <description>desc VBTBKR47</description>
                    <addressOffset>0xAF</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR48</name>
                    <description>desc VBTBKR48</description>
                    <addressOffset>0xB0</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR49</name>
                    <description>desc VBTBKR49</description>
                    <addressOffset>0xB1</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR50</name>
                    <description>desc VBTBKR50</description>
                    <addressOffset>0xB2</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR51</name>
                    <description>desc VBTBKR51</description>
                    <addressOffset>0xB3</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR52</name>
                    <description>desc VBTBKR52</description>
                    <addressOffset>0xB4</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR53</name>
                    <description>desc VBTBKR53</description>
                    <addressOffset>0xB5</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR54</name>
                    <description>desc VBTBKR54</description>
                    <addressOffset>0xB6</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR55</name>
                    <description>desc VBTBKR55</description>
                    <addressOffset>0xB7</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR56</name>
                    <description>desc VBTBKR56</description>
                    <addressOffset>0xB8</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR57</name>
                    <description>desc VBTBKR57</description>
                    <addressOffset>0xB9</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR58</name>
                    <description>desc VBTBKR58</description>
                    <addressOffset>0xBA</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR59</name>
                    <description>desc VBTBKR59</description>
                    <addressOffset>0xBB</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR60</name>
                    <description>desc VBTBKR60</description>
                    <addressOffset>0xBC</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR61</name>
                    <description>desc VBTBKR61</description>
                    <addressOffset>0xBD</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR62</name>
                    <description>desc VBTBKR62</description>
                    <addressOffset>0xBE</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR63</name>
                    <description>desc VBTBKR63</description>
                    <addressOffset>0xBF</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR64</name>
                    <description>desc VBTBKR64</description>
                    <addressOffset>0xC0</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR65</name>
                    <description>desc VBTBKR65</description>
                    <addressOffset>0xC1</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR66</name>
                    <description>desc VBTBKR66</description>
                    <addressOffset>0xC2</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR67</name>
                    <description>desc VBTBKR67</description>
                    <addressOffset>0xC3</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR68</name>
                    <description>desc VBTBKR68</description>
                    <addressOffset>0xC4</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR69</name>
                    <description>desc VBTBKR69</description>
                    <addressOffset>0xC5</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR70</name>
                    <description>desc VBTBKR70</description>
                    <addressOffset>0xC6</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR71</name>
                    <description>desc VBTBKR71</description>
                    <addressOffset>0xC7</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR72</name>
                    <description>desc VBTBKR72</description>
                    <addressOffset>0xC8</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR73</name>
                    <description>desc VBTBKR73</description>
                    <addressOffset>0xC9</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR74</name>
                    <description>desc VBTBKR74</description>
                    <addressOffset>0xCA</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR75</name>
                    <description>desc VBTBKR75</description>
                    <addressOffset>0xCB</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR76</name>
                    <description>desc VBTBKR76</description>
                    <addressOffset>0xCC</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR77</name>
                    <description>desc VBTBKR77</description>
                    <addressOffset>0xCD</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR78</name>
                    <description>desc VBTBKR78</description>
                    <addressOffset>0xCE</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR79</name>
                    <description>desc VBTBKR79</description>
                    <addressOffset>0xCF</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR80</name>
                    <description>desc VBTBKR80</description>
                    <addressOffset>0xD0</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR81</name>
                    <description>desc VBTBKR81</description>
                    <addressOffset>0xD1</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR82</name>
                    <description>desc VBTBKR82</description>
                    <addressOffset>0xD2</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR83</name>
                    <description>desc VBTBKR83</description>
                    <addressOffset>0xD3</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR84</name>
                    <description>desc VBTBKR84</description>
                    <addressOffset>0xD4</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR85</name>
                    <description>desc VBTBKR85</description>
                    <addressOffset>0xD5</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR86</name>
                    <description>desc VBTBKR86</description>
                    <addressOffset>0xD6</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR87</name>
                    <description>desc VBTBKR87</description>
                    <addressOffset>0xD7</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR88</name>
                    <description>desc VBTBKR88</description>
                    <addressOffset>0xD8</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR89</name>
                    <description>desc VBTBKR89</description>
                    <addressOffset>0xD9</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR90</name>
                    <description>desc VBTBKR90</description>
                    <addressOffset>0xDA</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR91</name>
                    <description>desc VBTBKR91</description>
                    <addressOffset>0xDB</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR92</name>
                    <description>desc VBTBKR92</description>
                    <addressOffset>0xDC</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR93</name>
                    <description>desc VBTBKR93</description>
                    <addressOffset>0xDD</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR94</name>
                    <description>desc VBTBKR94</description>
                    <addressOffset>0xDE</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR95</name>
                    <description>desc VBTBKR95</description>
                    <addressOffset>0xDF</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR96</name>
                    <description>desc VBTBKR96</description>
                    <addressOffset>0xE0</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR97</name>
                    <description>desc VBTBKR97</description>
                    <addressOffset>0xE1</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR98</name>
                    <description>desc VBTBKR98</description>
                    <addressOffset>0xE2</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR99</name>
                    <description>desc VBTBKR99</description>
                    <addressOffset>0xE3</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR100</name>
                    <description>desc VBTBKR100</description>
                    <addressOffset>0xE4</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR101</name>
                    <description>desc VBTBKR101</description>
                    <addressOffset>0xE5</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
