RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/EWARM/HDSC_HC32F480.svd
                <register>
                    <name>VBTBKR102</name>
                    <description>desc VBTBKR102</description>
                    <addressOffset>0xE6</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR103</name>
                    <description>desc VBTBKR103</description>
                    <addressOffset>0xE7</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR104</name>
                    <description>desc VBTBKR104</description>
                    <addressOffset>0xE8</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR105</name>
                    <description>desc VBTBKR105</description>
                    <addressOffset>0xE9</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR106</name>
                    <description>desc VBTBKR106</description>
                    <addressOffset>0xEA</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR107</name>
                    <description>desc VBTBKR107</description>
                    <addressOffset>0xEB</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR108</name>
                    <description>desc VBTBKR108</description>
                    <addressOffset>0xEC</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR109</name>
                    <description>desc VBTBKR109</description>
                    <addressOffset>0xED</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR110</name>
                    <description>desc VBTBKR110</description>
                    <addressOffset>0xEE</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR111</name>
                    <description>desc VBTBKR111</description>
                    <addressOffset>0xEF</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR112</name>
                    <description>desc VBTBKR112</description>
                    <addressOffset>0xF0</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR113</name>
                    <description>desc VBTBKR113</description>
                    <addressOffset>0xF1</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR114</name>
                    <description>desc VBTBKR114</description>
                    <addressOffset>0xF2</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR115</name>
                    <description>desc VBTBKR115</description>
                    <addressOffset>0xF3</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR116</name>
                    <description>desc VBTBKR116</description>
                    <addressOffset>0xF4</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR117</name>
                    <description>desc VBTBKR117</description>
                    <addressOffset>0xF5</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR118</name>
                    <description>desc VBTBKR118</description>
                    <addressOffset>0xF6</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR119</name>
                    <description>desc VBTBKR119</description>
                    <addressOffset>0xF7</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR120</name>
                    <description>desc VBTBKR120</description>
                    <addressOffset>0xF8</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR121</name>
                    <description>desc VBTBKR121</description>
                    <addressOffset>0xF9</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR122</name>
                    <description>desc VBTBKR122</description>
                    <addressOffset>0xFA</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR123</name>
                    <description>desc VBTBKR123</description>
                    <addressOffset>0xFB</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR124</name>
                    <description>desc VBTBKR124</description>
                    <addressOffset>0xFC</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR125</name>
                    <description>desc VBTBKR125</description>
                    <addressOffset>0xFD</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR126</name>
                    <description>desc VBTBKR126</description>
                    <addressOffset>0xFE</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBTBKR127</name>
                    <description>desc VBTBKR127</description>
                    <addressOffset>0xFF</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
